
/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
DROP TABLE IF EXISTS `class`;
/*!50001 DROP VIEW IF EXISTS `class`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `class` AS SELECT 
 1 AS `id`,
 1 AS `parent`,
 1 AS `text`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explclass`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explclass` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `translate` varchar(255) DEFAULT NULL,
  `interface` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explclass` WRITE;
/*!40000 ALTER TABLE `explclass` DISABLE KEYS */;
INSERT INTO `explclass` VALUES (1,'User','Пользователи','iUser'),(2,'Object','Объекты','iCard'),(3,'ControlNf','Контроль НФ','iControl'),(4,'ObjectPower','Мощности','iPower');
/*!40000 ALTER TABLE `explclass` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explclassprop`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explclassprop` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `cid` int(11) DEFAULT NULL,
  `pid` int(11) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `translate` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explclassprop` WRITE;
/*!40000 ALTER TABLE `explclassprop` DISABLE KEYS */;
INSERT INTO `explclassprop` VALUES (1,1,1,'rowid','№ п/п'),(2,1,2,'num','№ (вх, исх)'),(3,1,3,'date','дата'),(4,1,4,'summary','Краткое содержание, название, объект, адрес'),(5,1,5,'applicant','Заявитель '),(6,1,6,'responsible','Ответственный, соисполнители'),(7,1,7,'stage','Стадия исполнения, подтверждающие документы'),(8,1,8,'status','Исполнено, причина неисполнения'),(9,1,9,'cause','Причина неисполнения');
/*!40000 ALTER TABLE `explclassprop` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explcontrolnf`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explcontrolnf` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `number` varchar(255) DEFAULT NULL,
  `date` varchar(255) DEFAULT NULL,
  `summary` varchar(255) DEFAULT NULL,
  `applicant` varchar(255) DEFAULT NULL,
  `responsible` varchar(255) DEFAULT NULL,
  `stage` varchar(255) DEFAULT NULL,
  `status` varchar(255) DEFAULT NULL,
  `cause` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explcontrolnf` WRITE;
/*!40000 ALTER TABLE `explcontrolnf` DISABLE KEYS */;
INSERT INTO `explcontrolnf` VALUES (1,'СЗ-9999','01.01.2001','О предоставлении информации','Куркин А.И. - начальник отдела','Кульша В.И.','Собрать информацию по потразделениям','Исполнено',''),(2,'СЗ-9999','01.01.2001','О предоставлении информации','Куркин А.И. - начальник отдела','Кульша В.И.','Собрать информацию по потразделениям','На контроле',NULL),(3,'СЗ-9999','01.01.2001','О предоставлении информации','Куркин А.И. - начальник отдела','Кульша В.И.','Собрать информацию по потразделениям','Просрочено',NULL);
/*!40000 ALTER TABLE `explcontrolnf` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explmainmenu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explmainmenu` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `caption` varchar(255) DEFAULT NULL,
  `src` varchar(255) DEFAULT NULL,
  `classes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explmainmenu` WRITE;
/*!40000 ALTER TABLE `explmainmenu` DISABLE KEYS */;
INSERT INTO `explmainmenu` VALUES (1,'iMap','Объекты на карте','images/bMap.png','[2]'),(2,'iTable','Объекты в таблице','images/bSearch.png','[2]'),(3,'iPower','Мощности','images/bPower.png','[2]'),(4,'iAccounting','Аналитика и учет','images/bAccounting.png',NULL);
/*!40000 ALTER TABLE `explmainmenu` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explmainmenu_2x2`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explmainmenu_2x2` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `caption` varchar(255) DEFAULT NULL,
  `src` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explmainmenu_2x2` WRITE;
/*!40000 ALTER TABLE `explmainmenu_2x2` DISABLE KEYS */;
INSERT INTO `explmainmenu_2x2` VALUES (1,'iMap','Объекты на карте','images/bMap.png'),(2,'iTable','Объекты в таблице','images/bSearch.jpg'),(3,'iPower','Мощности','images/bPower.jpg'),(4,'iRent','Аренда','images/bRent.jpg');
/*!40000 ALTER TABLE `explmainmenu_2x2` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explmainmenu_copy`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explmainmenu_copy` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `caption` varchar(255) DEFAULT NULL,
  `src` varchar(255) DEFAULT NULL,
  `classes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explmainmenu_copy` WRITE;
/*!40000 ALTER TABLE `explmainmenu_copy` DISABLE KEYS */;
INSERT INTO `explmainmenu_copy` VALUES (1,'iMap','Объекты на карте','images/bMap.png','[2]'),(2,'iTable','Объекты в таблице','images/bSearch.jpg','[2]'),(3,'iControl','Контроль исполнения','images/bControl.jpg','[3]'),(4,'iDocs','Документы','images/bDocs_hover.jpg',NULL),(5,'iPower','Мощности','images/bPower.jpg','[2]'),(6,'iPhoto','Материалы','images/bPhoto_hover.png',NULL),(7,'iCounters','Приборы учета','images/bCounters_hover.jpg',NULL),(8,'iAccounting','Учет затрат','images/bAccounting_hover.png',NULL),(9,'iRent','Аренда','images/bRent_hover.jpg',NULL);
/*!40000 ALTER TABLE `explmainmenu_copy` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explobject`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explobject` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `tu` varchar(255) DEFAULT NULL,
  `ik` varchar(255) DEFAULT NULL,
  `manager` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `comment` varchar(255) DEFAULT NULL,
  `cadastr` varchar(255) DEFAULT NULL,
  `lat` float DEFAULT NULL,
  `lon` float DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=230 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explobject` WRITE;
/*!40000 ALTER TABLE `explobject` DISABLE KEYS */;
INSERT INTO `explobject` VALUES (1,'УЭИ','ПЭИ1','Волков','Воронеж','Воронежская область, г Воронеж, ул 121 Стрелковой дивизии, 11',NULL,'36:34:0403029:137',51.6448,39.1632),(2,'УЭИ','ПЭИ1','Волков','Лебедянь','Липецкая обл, Лебедянь, Почтовая, 6',NULL,NULL,53.0101,39.1321),(3,'УЭИ','ПЭИ1','Волков','Балашиха Гагарина','Московская область, Балашихинский район, г. Балашиха, мкр. Гагарина',NULL,'50:15:0000000:148147',55.8268,37.9179),(4,'УЭИ','ПЭИ1','Волков','Балашиха Орджоникидзе','МО, Балашиха, Орджоникидзе, Военный городок, 8',NULL,NULL,55.8207,37.9401),(5,'УЭИ','ПЭИ1','Волков','Королев','Московская область, г. Королев, ул. Ломоносова, д. 7А',NULL,'50:45:0040509:93',55.9089,37.82),(6,'УЭИ','ПЭИ1','Волков','Луховицы','МО, Луховицы, пос. ст. Черная',NULL,NULL,55.0263,38.9203),(7,'УЭИ','ПЭИ1','Волков','Щелково Автобаза','МО, Щелково, Автобаза',NULL,NULL,55.8738,38.0881),(8,'УЭИ','ПЭИ1','Волков','Щелково ВСО','МО, Щелково, ВСО',NULL,NULL,55.8806,38.0788),(9,'УЭИ','ПЭИ1','Волков','Щелково Здание со служебным помещением','МО, Щелково, Здание со служебным помещением',NULL,NULL,55.881,38.0827),(10,'УЭИ','ПЭИ1','Волков','Щелково КБЗ','Московская обл Щелково КБЗ',NULL,NULL,55.8913,38.0712),(11,'УЭИ','ПЭИ1','Волков','Щелково Лесоцех','Московская обл Щелково Лесоцех',NULL,NULL,55.8892,38.0707),(12,'УЭИ','ПЭИ1','Волков','Дуброво','Московская обл Щелковский р-н Дуброво',NULL,NULL,56.0732,38.5202),(13,'УЭИ','ПЭИ1','Волков','Монино Новинское 4','Московская обл Щелковский р-н Монино Новинское ш 4',NULL,NULL,55.8445,38.1996),(14,'УЭИ','ПЭИ1','Волков','Монино Южная 5а','Московская обл Щелковский р-н Монино Южная 5а',NULL,NULL,55.8422,38.1881),(15,'УЭИ','ПЭИ1','Волков','Монино Южная 24','Московская обл Щелковский р-н Монино Южная 24',NULL,NULL,55.8443,38.1858),(16,'УЭИ','ПЭИ1','Волков','Ярославль Белинского 35','обл. Ярославская, г. Ярославль, ул. Белинского, дом 35',NULL,'76:23:050411:6',57.6352,39.8376),(17,'УЭИ','ПЭИ1','Волков','Ярославль Перовской 60','обл. Ярославская, г. Ярославль, пер. С.Перовской, дом № 60',NULL,'76:23:041204:0017',57.5893,39.8007),(18,'УЭИ','ПЭИ2','Солтан','Внуково','Москва Внуково Центральная 18',NULL,NULL,55.6179,37.2747),(19,'УЭИ','ПЭИ2','Солтан','Клин Советская 3','обл. Московская, р-н Клинский, г/пос Клин, г. Клин, пл. Советская, дом 3',NULL,'50:03:0010311:32',56.3345,36.734),(20,'УЭИ','ПЭИ2','Солтан','Клин Трудовая 45','обл. Московская, р-н Клинский, г/пос Клин, г. Клин, ул. Трудовая, уч.45',NULL,'50:03:0010112:108',56.3423,36.7013),(21,'УЭИ','ПЭИ2','Солтан','Красногорск-Митино',' Московская область, Красногорский район, п/о Красногорск-4, коммунальная зона Красногорск-Митино, д. 20',NULL,'50:11:0010104:564',55.8407,37.3432),(22,'УЭИ','ПЭИ2','Солтан','Архангельское','Московская область, Красногорский муниципальный район, г/п Ильинское, п.Архангельское, строение 6',NULL,'50:11:0050609:1429',55.7862,37.2986),(23,'УЭИ','ПЭИ2','Солтан','Нахабино','Московская область, Красногорский муниципальный район, городское поселение Нахабино, р.п. Нахабино, ул. Новая',NULL,'50:11:0030305:1222',55.8434,37.1423),(24,'УЭИ','ПЭИ2','Солтан','Одинцово','обл. Московская, р-н Одинцовский, г.Одинцово-1, военный городок №315, строение 11',NULL,'50:20:0030206:126',55.6562,37.2708),(25,'УЭИ','ПЭИ2','Солтан','Реутов','Носовихинское шоссе, 23, Реутов, Московская область, Россия',NULL,NULL,55.7483,37.8752),(26,'УЭИ','ПЭИ2','Солтан','Перепечино','Московская область, Солнечногорский район, сельское поселение Луневское, вблизи деревни Перепечино',NULL,'50:09:0060736:486',55.9867,37.3965),(27,'УЭИ','ПЭИ2','Солтан','Чашниково','Солнечногорский район, в районе д. Чашниково',NULL,'50:09:0060710:67',55.9952,37.4248),(28,'УЭИ','ПЭИ2','Солтан','Тверь','улица Горького, 107 Тверь, Россия',NULL,'69:40:0100229:39',56.8695,35.8865),(29,'УЭИ','ПЭИ2','Солтан','Краснознаменск','обл. Московская, г. Краснознаменск, ул. Связистов, дом 3',NULL,'50:51:0000000:26',55.5985,37.0536),(30,'УЭИ','ПЭИ2','Солтан','Марфино','обл. Московская, р-н Мытищинский, сельское поселение Федоскинское, юго-восточнее с. Марфино',NULL,'50:12:0030409:1',56.0693,37.575),(31,'УЭИ','ПЭИ2','Солтан','Челобитьево','обл. Московская, р-н Мытищинский, городское поселение Мытищи, возле д.Челобитьево',NULL,'50:12:0102305:17',55.8999,37.6794),(32,'УЭИ','ПЭИ3','Алексеев','Знаменск','Астраханская обл Знаменск Сельский пер 1',NULL,NULL,48.5831,45.7514),(33,'УЭИ','ПЭИ3','Алексеев','Кирпичный','Москва, 1-й Кирпичный переулок, 17А',NULL,NULL,55.7757,37.7343),(34,'УЭИ','ПЭИ3','Алексеев','Арбатецкая','Москва, Арбатецкая улица, 2с8 - 2с16',NULL,NULL,55.7278,37.6608),(35,'УЭИ','ПЭИ3','Алексеев','Большой Предтеченский','Москва, Большой Предтеченский переулок, 30с1',NULL,NULL,55.7612,37.5633),(36,'УЭИ','ПЭИ3','Алексеев','Гончарная','Москва, Гончарная улица, 28',NULL,NULL,55.7429,37.6487),(37,'УЭИ','ПЭИ3','Алексеев','Золоторожский вал','Москва, улица Золоторожский Вал, вл16',NULL,NULL,55.7519,37.6852),(38,'УЭИ','ПЭИ3','Алексеев','Маршала Жукова','Москва, проспект Маршала Жукова, 38',NULL,NULL,55.7772,37.4724),(39,'УЭИ','ПЭИ3','Алексеев','Маршала Конева','Москва, улица Маршала Конева, 6',NULL,NULL,55.7999,37.4918),(40,'УЭИ','ПЭИ3','Алексеев','Мосренген','Москва, поселок завода Мосрентген',NULL,NULL,55.6228,37.463),(41,'УЭИ','ПЭИ3','Алексеев','Смоленский','Москва, Смоленский бульвар, 19с1',NULL,NULL,55.7434,37.5834),(42,'УЭИ','ПЭИ3','Алексеев','Сокольнический вал','Москва, улица Сокольнический Вал, 1Кс1',NULL,NULL,55.7948,37.6542),(43,'УЭИ','ПЭИ3','Алексеев','Хорошевское 38','Москва, Хорошёвское шоссе, 38с4',NULL,NULL,55.7767,37.5388),(44,'УЭИ','ПЭИ3','Алексеев','Толбино Малое','Московская область, городской округ Подольск, деревня Малое Толбино',NULL,NULL,55.3307,37.4857),(45,'УЭИ','ПЭИ3','Алексеев','Молодежный','Московская область, городской округ Подольск, поселок Молодёжный',NULL,NULL,55.3273,37.4906),(46,'УЭИ','ПЭИ3','Алексеев','Чехов','Московская область, Чехов, микрорайон Венюково, улица Джона Рида, 9',NULL,NULL,55.1556,37.4277),(47,'УЭИ','ПЭИ3','Алексеев','Верхнелихоборская','Москва,  ул Верхнелихоборская, д. 6',NULL,'77:09:0002030:77',55.8522,37.5591),(48,'УЭИ','ПЭИ3','Алексеев','Косыгина','Москва, ул Косыгина, вл 30',NULL,'77:07:0010001:23',55.71,37.5474),(49,'УЭИ','ПЭИ4','Воробьев','Геленджик','Краснодарский край, Геленджик, улица Островского, 168',NULL,NULL,44.5511,38.1056),(50,'УЭИ','ПЭИ4','Воробьев','Крымск Жукова 52г','Краснодарский край, Крымск, улица Маршала Жукова, 52Г ',NULL,'23:45:0101252:140',44.9304,38.011),(51,'УЭИ','ПЭИ4','Воробьев','Крымск Жукова 52д','Краснодарский край Крымск Жукова 52д',NULL,'23:45:0101252:139',44.9309,38.0103),(52,'УЭИ','ПЭИ4','Воробьев','Лавровая','Краснодарский край, Сочи, Лавровая улица, 5',NULL,'23:49:0202005:15',43.6311,39.718),(53,'УЭИ','ПЭИ4','Воробьев','Северная','Краснодарский край, Сочи, Северная улица, 14А',NULL,'23:49:0204002:33',43.5951,39.7253),(54,'УЭИ','ПЭИ4','Воробьев','Тимирязева','Краснодарский край, Сочи, улица Тимирязева, 34Б',NULL,'23:49:0202010:5',43.6311,39.7236),(55,'УЭИ','ПЭИ4','Воробьев','Тоннельная','край Краснодарский, г. Сочи, р-н Центральный, ул. Тоннельная, 27-а',NULL,'23:49:0205031:0015',43.5882,39.7295),(56,'УЭИ','ПЭИ4','Воробьев','Лысая гора','край Краснодарский, г. Сочи, р-н Хостинский, по ул. Лысая Гора',NULL,'23:49:0302004:48',43.5802,39.7429),(57,'УЭИ','ПЭИ4','Воробьев','Курортный','Сочи, пр-кт Курортный, д. 95В',NULL,'23:49:0302026:1146',43.5606,39.7602),(58,'СЗТП','ИК1','Лобзин','Луч 3',' г.Санкт-Петербург, улица 2-й Луч, дом 3, литера А',NULL,'78:12:0007012:27',59.9099,30.3969),(59,'СЗТП','ИК1','Лобзин','Луч 18',' г.Санкт-Петербург, улица 2-й Луч, дом 18, литера А',NULL,'78:12:0007020:32',59.9058,30.4009),(60,'СЗТП','ИК1','Лобзин','Атаманская','г.Санкт-Петербург, Атаманская улица, дом 6, литера А',NULL,'78:31:0151502:3331',59.9203,30.3681),(61,'СЗТП','ИК1','Лобзин','Пушкин','Санкт-Петербург, город Пушкин, Автомобильная улица, дом 5',NULL,'78:42:0018301:1045',59.7358,30.4464),(62,'СЗТП','ИК1','Лобзин','Седова','г.Санкт-Петербург, улица Седова, дом 4',NULL,'78:12:0007012:2028',59.9051,30.3847),(63,'СЗТП','ИК1','Лобзин','Гангутска - Соляной','г.Санкт-Петербург, Соляной переулок, дом 9',NULL,NULL,59.944,30.3395),(64,'СЗТП','ИК1','Лобзин','Тележная','г.Санкт-Петербург, Тележная улица, дом 8-10, литера Б',NULL,'78:31:0001499:10',59.9269,30.3738),(65,'СЗТП','ИК2','Бучинский','Ромашки','Ленинградская область, Приозерский район, Ромашкинское сельское поселение, пос.Понтонное, военный городок Ромашки-1, База отдыха Ромашки',NULL,NULL,60.6973,29.8454),(66,'СЗТП','ИК2','Бучинский','Звенигородская','г.Санкт-Петербург, Звенигородская улица, дом 1, литера А',NULL,'78:32:0001627:9',59.9228,30.335),(67,'СЗТП','ИК2','Бучинский','Измайловский','г.Санкт-Петербург, Измайловский проспект, дом 15, литера А',NULL,'78:32:0001667:3',59.9133,30.3061),(68,'СЗТП','ИК2','Бучинский','Приморский','Санкт-Петербург, Приморский просп, 58',NULL,NULL,59.9808,30.2276),(69,'СЗТП','ИК2','Бучинский','Рощинская','Санкт-Петербург, Рощинская, 1',NULL,NULL,59.8853,30.3083),(70,'СЗТП','ИК2','Бучинский','Старо-Петергофский','г.Санкт-Петербург, Старо-Петергофский проспект, дом 9а, литера Н',NULL,'78:32:0001610:11',59.9145,30.2773),(71,'СЗТП','ИК3','Ларионов','Лебяжье','Ленинградская область, Ломоносовский муниципальный район, Лебяженское городское поселение, г.п. Лебяжье',NULL,'47:14:0000000:36944',59.9571,29.4263),(72,'СЗТП','ИК3','Ларионов','Кронштадтское','Санкт-Петербург, город Кронштадт, Кронштадтское шоссе, дом 7б, литера Б',NULL,'78:34:0010210:4',60.0032,29.7603),(73,'СЗТП','ИК3','Ларионов','Якорная','Санкт-Петербург, город Кронштадт, Якорная площадь, дом 2б, литера А',NULL,'78:34:0010310:3666',59.9916,29.7826),(74,'СЗТП','ИК3','Ларионов','Богумиловская','Санкт-Петербург, город Ломоносов, Богумиловская улица, дом 18, литера Б',NULL,'78:40:2041401:3',59.9095,29.7941),(75,'СЗТП','ИК3','Ларионов','Гаванский','Санкт-Петербург, город Ломоносов, Гаванский переулок, дом 12',NULL,'78:40:2054101:1',59.9254,29.7694),(76,'СЗТП','ИК3','Ларионов','Мира','Санкт-Петербург, город Ломоносов, улица Мира, дом 3а, литера Б',NULL,'78:40:0020403:55',59.8924,29.8102),(77,'СЗТП','ИК3','Ларионов','Пароходная','Санкт-Петербург, город Ломоносов, Пароходная улица, дом 17б, литера Б',NULL,'78:40:2054104:1028',59.9233,29.7644),(78,'СЗТП','ИК3','Ларионов','Сафронова','Санкт-Петербург, город Ломоносов, улица Сафронова, дом 4а, литера А',NULL,'78:40:0020527:15',59.9112,29.7826),(79,'СЗТП','ИК4','Броневич','Песочное','Ленинградская обл, пос. Песочное',NULL,NULL,60.1642,29.3384),(80,'СЗТП','ИК5','Мартынов','Балтийск','Калининградская область, р-н Балтийский, г Балтийск, Нижнее 13',NULL,'39:14:010356: 133',54.6397,19.931),(81,'СЗТП','ИК5','Мартынов','Артиллерийская','Калининградская область, г Калининград, ул Артиллерийская, д 13-15, пом I',NULL,'39:15:131913:268',54.733,20.5364),(82,'СЗТП','ИК5','Мартынов','Железнодорожная','Калининградская область, г Калининград, ул Железнодорожная, д 5',NULL,'39:15:140804:57',54.6911,20.5068),(83,'СЗТП','ИК5','Мартынов','Пригородная','Калининградская обл, г Калининград, ул Пригородная, дом 11',NULL,'39:15:132702:486',54.727,20.5614),(84,'СЗТП','ИК5','Мартынов','Стрелецкая','Калининградская обл, г Калининград, ул Стрелецкая, дом 8',NULL,'39:15:132801:33',54.717,20.5451),(85,'СЗТП','ИК6','Пастернак','Архангельск','обл. Архангельская, г. Архангельск, ул. Дрейера, дом 1, корпус 3',NULL,'29:22:081001:9',64.4999,40.584),(86,'СЗТП','ИК6','Пастернак','Героев Рыбачьего','Мурманская обл., МО г. Мурманск, ул. Героев Рыбачьего, на земельном участке расположено здание (сооружение)',NULL,'51:20:0001308:68',68.9014,33.1056),(87,'СЗТП','ИК6','Пастернак','Нижне-Ростинское','Мурманская обл., МО г. Мурманск, ш. Нижне-Ростинское, на земельном участке расположены здания (сооружения)',NULL,'51:20:0003211:18',69.0015,33.0565),(88,'СЗТП','ИК6','Пастернак','Позднякова','Мурманская обл., МО г. Мурманск, ул. Позднякова, д. 6',NULL,NULL,69.0194,33.1033),(89,'СЗТП','ИК6','Пастернак','Речной','Мурманская обл., МО г. Мурманск, Речной проезд, на земельном участке расположено здание №7',NULL,'51:20:0003184:348',69.0129,33.1107),(90,'СЗТП','ИК6','Пастернак','Сафоново','Мурманская обл, пос. Сафоново',NULL,NULL,69.0565,33.29),(91,'СЗТП','ИК6','Пастернак','Заводская','Мурманская обл, г. Североморск, ул. Заводская, 1',NULL,NULL,69.0696,33.3871),(92,'СЗТП','ИК6','Пастернак','Богатырь','Мурманская обл., МО ЗАТО г. Североморск, г. Североморск, ул. Колышкина, на земельном участке расположено здание № 11',NULL,'51:06:0030106:1178',69.0653,33.4081),(93,'СЗТП','ИК6','Пастернак','Мурманское 5','Мурманская обл., МО ЗАТО г. Североморск, г. Североморск, ул. Заводская, на земельном участке расположено здание',NULL,'78:14:0751301:2049',69.0625,33.3889),(94,'СЗТП','ИК6','Пастернак','Мурманское 8','Мурманская обл., МО ЗАТО г. Североморск, г. Североморск, ш. Мурманское, д. 8',NULL,'51:06:0030103:1220',69.0702,33.3904),(95,'СЗТП','ИК6','Пастернак','Падорина','Мурманская область, г.Североморск, ул.Падорина, д.7',NULL,'51:06:0030104:2253',69.0687,33.406),(96,'СЗТП','ИК6','Пастернак','Советская','Мурманская обл., МО ЗАТО г. Североморск, г. Североморск, ул. Советская, на земельном участке расположено здание № 18',NULL,'51:06:0030106:2',69.0669,33.4183),(97,'СЗТП','ИК7','Лёгоньких','Металлострой','Санкт-Петербург, поселок Металлострой, дорога на Металлострой, дом 12, литера А',NULL,'78:37:1741003:1157',59.8041,30.5634),(98,'СЗТП','ИК7','Лёгоньких','Революции','г.Санкт-Петербург, шоссе Революции, дом 52, литера А',NULL,'78:11:0006077:7',59.9604,30.4349),(99,'СЗТП','ИК7','Лобзин','Седова','г.Санкт-Петербург, улица Седова, дом 4',NULL,NULL,59.9051,30.3847),(100,'СЗТП','ИК7','Лобзин','Тележная',' г.Санкт-Петербург, Тележная улица, дом 8-10, литера Б',NULL,'78:31:0001499:10',59.9269,30.3738),(101,'СиДВ','ИК1','Богатырев','Ватутина','край Приморский, г. Артем, ул. Ватутина, дом 9',NULL,'25:27:030106:893',43.3458,132.164),(102,'СиДВ','ИК1','Богатырев','Муравьиная','край Приморский, г. Артем, бухта Муравьиная, 2',NULL,'25:27:020102:127',43.2586,132.255),(103,'СиДВ','ИК1','Богатырев','Орджоникидзе','край Приморский, г. Артем, ул. Орджоникидзе, дом 17',NULL,'25:27:070203:41',43.3254,132.092),(104,'СиДВ','ИК1','Богатырев','Бархатная 3','Приморский край, г Владивосток, ул Бархатная, д 3',NULL,'25:28:030013:232',43.0727,131.939),(105,'СиДВ','ИК1','Богатырев','Бархатная 7','край Приморский, г. Владивосток, ул. Бархатная, дом 7',NULL,'25:28:030013:165',43.0702,131.936),(106,'СиДВ','ИК1','Богатырев','Бородинская','край Приморский, г. Владивосток, ул. Бородинская, дом 61',NULL,'25:28:040014:32',43.164,131.942),(107,'СиДВ','ИК1','Богатырев','Верхнепортовая 12а','край Приморский, г. Владивосток, ул. Верхнепортовая, 12а',NULL,NULL,43.1076,131.878),(108,'СиДВ','ИК1','Богатырев','Верхнепортовая 12в','край Приморский, г. Владивосток, ул. Верхнепортовая, 12в',NULL,NULL,43.1073,131.878),(109,'СиДВ','ИК1','Богатырев','Верхнепортовая 12г','край Приморский, г. Владивосток, ул. Верхнепортовая, 12г',NULL,NULL,43.1073,131.878),(110,'СиДВ','ИК1','Богатырев','Верхнепортовая 76б','край Приморский, г. Владивосток, ул. Верхнепортовая, дом 76б',NULL,'25:28:020033:42',43.0979,131.86),(111,'СиДВ','ИК1','Богатырев','Воровского','край Приморский, г. Владивосток, ул. Воровского, дом 10',NULL,'25:28:050024:257',43.2629,132.04),(112,'СиДВ','ИК1','Богатырев','Гоголя','край Приморский, г. Владивосток, ул. Гоголя, дом 54',NULL,'25:28:040008:134',43.1276,131.908),(113,'СиДВ','ИК1','Богатырев','Катерная','г Владивосток, ул Катерная, д. 12б',NULL,'25:28:030013:6',43.0738,131.938),(114,'СиДВ','ИК1','Богатырев','Леонова','Приморский край, г. Владивосток, ул. Леонова, 54',NULL,'25:28:020033:8',43.0902,131.858),(115,'СиДВ','ИК1','Богатырев','Минеров','край Приморский, г. Владивосток, ул. Минеров, 7',NULL,'25:28:030012:45',43.0928,131.931),(116,'СиДВ','ИК1','Богатырев','о. Русский','Приморский край, г. Владивосток, о. Русский, п. Подножье, 20',NULL,'25:28:060136:3',43.046,131.811),(117,'СиДВ','ИК1','Богатырев','Посьетская',' край Приморский, г. Владивосток, ул. Посьетская, дом 23а',NULL,NULL,43.1115,131.878),(118,'СиДВ','ИК1','Богатырев','Сахалинская 5а',' край Приморский, г. Владивосток, ул. Сахалинская, дом 5',NULL,NULL,43.0957,131.967),(119,'СиДВ','ИК1','Богатырев','Сахалинская 34','Приморский край, г Владивосток, ул Сахалинская, 34',NULL,NULL,43.0933,131.966),(120,'СиДВ','ИК1','Богатырев','Слуцкого','край Приморский, г. Владивосток, ул. Слуцкого, дом 5а',NULL,'25:28:030012:40',43.0951,131.929),(121,'СиДВ','ИК1','Богатырев','Фадеева 42','край Приморский, г. Владивосток, ул. Фадеева, дом 42',NULL,'25:28:010040:16',43.0992,131.962),(122,'СиДВ','ИК1','Богатырев','Фадеева 81','край Приморский, г. Владивосток, ул. Фадеева, дом 81',NULL,'25:28:010044:126',43.1138,131.985),(123,'СиДВ','ИК1','Богатырев','Николаевка','край Приморский, р-н Партизанский, п. Николаевка, ул. Фадеева, дом 1',NULL,NULL,43.0825,133.202),(124,'СиДВ','ИК1','Богатырев','Фокино Дунай Морская','край Приморский, р-н городской округ ЗАТО город Фокино, г. Фокино, п. Дунай, ул. Морская, 30',NULL,'25:35080201:92',42.8879,132.364),(125,'СиДВ','ИК1','Богатырев','Фокино Дунай Судоремонтная','край Приморский, р-н городской округ ЗАТО город Фокино, г. Фокино, п. Дунай, ул. Судоремонтная, 10',NULL,'25:35:020201:54',42.905,132.344),(126,'СиДВ','ИК1','Богатырев','Фокино Заводская 1','край Приморский, р-н городской округ ЗАТО город Фокино, г. Фокино, ул. Заводская, дом 1',NULL,'25:35:050301:310',42.9672,132.398),(127,'СиДВ','ИК1','Богатырев','Фокино Заводская 3-4','Приморский край, ЗАТО г. Фокино, ул. Заводская, 4',NULL,'25:35:050101:226',42.9684,132.395),(128,'СиДВ','ИК1','Богатырев','Фокино Заводская 6','Приморский край, городской округ ЗАТО город Фокино, ул. Заводская, 6',NULL,'25:35:050101:663',42.969,132.397),(129,'СиДВ','ИК1','Богатырев','Фокино Заводская 8','край Приморский, р-н городской округ ЗАТО город Фокино, г. Фокино, ул. Заводская, 8',NULL,'25:35:050101:211',42.9708,132.399),(130,'СиДВ','ИК1','Богатырев','Фокино Заводская 10','край Приморский, р-н городской округ ЗАТО город Фокино, г. Фокино, ул. Заводская, 10',NULL,'25:35:050101:212',42.9782,132.396),(131,'СиДВ','ИК1','Богатырев','Фокино Усатого','край Приморский, р-н городской округ ЗАТО город Фокино, г. Фокино, ул. Усатого, дом 29',NULL,'25:35:050201:0101',42.9792,132.42),(132,'СиДВ','ИК2','Туркин','Вилючинск','Камчатский край, г Вилючинск',NULL,'41:02:010104:383',52.9494,158.412),(133,'СиДВ','ИК2','Туркин','Елизово','Камчатский край, Елизово, Красноярская улица',NULL,NULL,53.16,158.436),(134,'СиДВ','ИК2','Туркин','Ключи','Камчатский край, Усть-Камчатский район, посёлок Ключи',NULL,NULL,56.3035,160.849),(135,'СиДВ','ИК2','Туркин','Завойко','Камчатский край, Петропавловск-Камчатский, поселок Завойко',NULL,NULL,52.955,158.694),(136,'СиДВ','ИК2','Туркин','Рябиковская 36а - ГАРАЖ','г Петропавловск-Камчатский, ул Рябиковская, д. 36',NULL,NULL,52.9941,158.657),(137,'СиДВ','ИК2','Туркин','Рябиковская 36а - ШТАБ','г Петропавловск-Камчатский, ул Рябиковская, д. 36',NULL,NULL,52.9941,158.657),(138,'СиДВ','ИК2','Туркин','Рябиковская 36в - ШТАБ','г Петропавловск-Камчатский, ул Рябиковская, д. 36',NULL,NULL,52.9941,158.657),(139,'СиДВ','ИК2','Туркин','Рябиковская 51 - 116 МСЗ','г Петропавловск-Камчатский, ул Рябиковская, д. 36',NULL,NULL,52.9941,158.657),(140,'СиДВ','ИК2','Туркин','Рябиковская 51 - 1184 КМТС','г Петропавловск-Камчатский, ул Рябиковская, д. 36',NULL,NULL,52.9941,158.657),(141,'СиДВ','ИК2','Туркин','Садовая','г Петропавловск-Камчатский, ул Садовая, д. 10-б',NULL,'41:01:010127:0139',52.9804,158.678),(142,'СиДВ','ИК2','Туркин','Солнечная','г Петропавловск-Камчатский, ул Солнечная, д. 1 А',NULL,NULL,53.0272,158.702),(143,'СиДВ','ИК2','Туркин','Халактырское 7','г Петропавловск-Камчатский, ш Халактырское, д. 7',NULL,'41:01:0010125:267',53.0286,158.707),(144,'СиДВ','ИК3','Разгон','Волочаевская','г Хабаровск, ул Волочаевская, д. 163, 60',NULL,NULL,48.4806,135.064),(145,'СиДВ','ИК3','Разгон','Гамарника','край Хабаровский, г. Хабаровск, ул. Гамарника, дом 43, 103',NULL,'27:23:0030409:1926',48.4759,135.085),(146,'СиДВ','ИК3','Разгон','Ленина','г Хабаровск, ул Ленина, д. 37',NULL,'27:23:0030302:3',48.4737,135.078),(147,'СиДВ','ИК3','Разгон','Радищева','край Хабаровский, г. Хабаровск, ул. Радищева, дом 3',NULL,'27:23:0050313:2',48.4489,135.101),(148,'СиДВ','ИК4','Ушкин','Архалей','Забайкальский край, р-н Читинский, с Преображенка, ул Арахлейская, 16',NULL,'75:22:080101:165',52.2049,112.822),(149,'СиДВ','ИК4','Ушкин','Кайдаловская','Забайкальский край, Чита, Кайдаловская, 2а',NULL,NULL,52.0377,113.524),(150,'СиДВ','ИК4','Ушкин','Смоленская','Забайкальский край, Чита, Смоленская, 39',NULL,NULL,52.0411,113.513),(151,'СиДВ','ИК5','Белорусова','Иркутск Красноярская','Иркутск, Красноярская, 53',NULL,NULL,52.2746,104.33),(152,'СиДВ','ИК6','Токарев','Чуна','Иркутская область, Чунский район, п. Октябрьский, ул. Военных Строителей, № 1',NULL,'38:21:030110:10',56.8276,99.1677),(153,'СиДВ','ИК7','Емельянов','Армейская 13 АЗС','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0526,92.9395),(154,'СиДВ','ИК7','Емельянов','Армейская 13 Водопровод','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0528,92.9392),(155,'СиДВ','ИК7','Емельянов','Армейская 13 Земельный участок','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,'24:50:0400101:1712',56.0531,92.9398),(156,'СиДВ','ИК7','Емельянов','Армейская 13 КТП','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0523,92.9393),(157,'СиДВ','ИК7','Емельянов','Армейская 13 Гараж на 16 авто','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0531,92.939),(158,'СиДВ','ИК7','Емельянов','Армейская 13 РБУ','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0537,92.9394),(159,'СиДВ','ИК7','Емельянов','Армейская 13 Гараж на 16 авто с мастерской','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0537,92.9405),(160,'СиДВ','ИК7','Емельянов','Армейская 13 Гараж на 30 авто','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0527,92.9401),(161,'СиДВ','ИК7','Емельянов','Армейская 13 Склад','Красноярский край, г. Красноярск, ул. Армейская, участок 13г',NULL,NULL,56.0523,92.94),(162,'СиДВ','ИК7','Емельянов','Армейская 23 Склад с магазином','Красноярский край, г. Красноярск, ул. Армейская, участок 23г',NULL,NULL,56.0531,92.9386),(163,'СиДВ','ИК7','Емельянов','Башиловская 17 АБЗ','Красноярский край, г. Красноярск, Советский район, Северо-Восточный промузел, Башиловская, 17',NULL,NULL,56.0824,92.97),(164,'СиДВ','ИК7','Емельянов','Башиловская 17 Административное здание','Красноярский край, г. Красноярск, Советский район, Северо-Восточный промузел, Башиловская, 17',NULL,NULL,56.0811,92.9687),(165,'СиДВ','ИК7','Емельянов','Башиловская 17 Земельный участок','Красноярский край, г. Красноярск, Советский район, Северо-Восточный промузел, Башиловская, 17',NULL,'24:50:0400388:17',56.0819,92.9687),(166,'СиДВ','ИК7','Емельянов','Башиловская 17 ТП-9000','Красноярский край, г. Красноярск, Советский район, Северо-Восточный промузел, Башиловская, 17',NULL,NULL,56.0819,92.9694),(167,'СиДВ','ИК7','Емельянов','Малиновского 20 Ограждение','Красноярский край,г.Красноярск, ул. Малиновского, 20а',NULL,'24:50:0400101:1713',56.0472,92.9257),(168,'СиДВ','ИК7','Емельянов','Малиновского 20 Штаб мастерские','Красноярский край,г.Красноярск, ул. Малиновского, 20а',NULL,NULL,56.047,92.9261),(169,'СиДВ','ИК7','Емельянов','Малиновского 20 КПП гараж','Красноярский край,г.Красноярск, ул. Малиновского, 20а',NULL,NULL,56.0472,92.9253),(170,'СиДВ','ИК7','Емельянов','Малиновского 20 Трансформаторная подстанция','Красноярский край,г.Красноярск, ул. Малиновского, 20а',NULL,NULL,56.0474,92.9274),(171,'СиДВ','ИК7','Емельянов','Малиновского 20 Склад','Красноярский край,г.Красноярск, ул. Малиновского, 20а',NULL,NULL,56.0467,92.9271),(172,'СиДВ','ИК7','Емельянов','Малиновского 20 ЛЭП','Красноярский край,г.Красноярск, ул. Малиновского, 20а',NULL,NULL,56.0466,92.9288),(173,'СиДВ','ИК7','Емельянов','Малиновского 20 Теплотрасса','Красноярский край,г.Красноярск, ул. Малиновского, 20а',NULL,NULL,56.048,92.9274),(174,'СиДВ','ИК7','Емельянов','Малиновского 27','Красноярский край,г.Красноярск, ул. Малиновского, 27',NULL,NULL,56.0499,92.9396),(175,'СиДВ','ИК7','Емельянов','Петразаводская','обл. Новосибирская, р-н Новосибирский, МО Мочищенский сельсовет',NULL,'54:19:101102:27',55.1294,82.9172),(176,'СиДВ','ИК7','Емельянов','Гаранина Земельный участок','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,'54:35:071145:9',55.0262,82.9715),(177,'СиДВ','ИК7','Емельянов','Гаранина Автомастерские','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0262,82.9709),(178,'СиДВ','ИК7','Емельянов','Гаранина АЗС','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0265,82.9705),(179,'СиДВ','ИК7','Емельянов','Гагарина Гараж на 32 авто','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0261,82.9721),(180,'СиДВ','ИК7','Емельянов','Гагарина Гараж на 64 авто','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0254,82.9724),(181,'СиДВ','ИК7','Емельянов','Гагарина Котельная','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0256,82.9714),(182,'СиДВ','ИК7','Емельянов','Гагарина КТП','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0259,82.97),(183,'СиДВ','ИК7','Емельянов','Гагарина Мойка','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0266,82.9721),(184,'СиДВ','ИК7','Емельянов','Гагарина Ограждение','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0262,82.9715),(185,'СиДВ','ИК7','Емельянов','Гагарина Теплотрасса','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0262,82.9715),(186,'СиДВ','ИК7','Емельянов','Гагарина Склад','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0269,82.97),(187,'СиДВ','ИК7','Емельянов','Гагарина ТП-28','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0267,82.9709),(188,'СиДВ','ИК7','Емельянов','Гагарина Штаб','обл. Новосибирская, г. Новосибирск, ул. Гаранина, 33',NULL,NULL,55.0258,82.9702),(189,'СиДВ','ИК7','Емельянов','Механическая Земельный участок','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,'54:35:081355:11',54.9626,83.0562),(190,'СиДВ','ИК7','Емельянов','Механическая Будка','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9627,83.055),(191,'СиДВ','ИК7','Емельянов','Механическая Гараж на 3 авто','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9627,83.0556),(192,'СиДВ','ИК7','Емельянов','Механическая Гараж на 5 авто','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9626,83.0552),(193,'СиДВ','ИК7','Емельянов','Механическая Гараж на 8 авто','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9626,83.0556),(194,'СиДВ','ИК7','Емельянов','Механическая Здание ЦЗМ','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9625,83.056),(195,'СиДВ','ИК7','Емельянов','Механическая Мастерская','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9626,83.0565),(196,'СиДВ','ИК7','Емельянов','Механическая Склад','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9624,83.0554),(197,'СиДВ','ИК7','Емельянов','Механическая Теплотрасса','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.9618,83.0558),(198,'СиДВ','ИК7','Емельянов','Механическая ТП','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.962,83.0557),(199,'СиДВ','ИК7','Емельянов','Механическая Цех электросварки','обл. Новосибирская, г. Новосибирск, ул. 1-я Механическая, 18',NULL,NULL,54.962,83.0558),(200,'СиДВ','ИК7','Емельянов','Солидарности Земельный участок','Новосибирская область, г. Новосибирск,ул. Солидарности, дом 103',NULL,'54:35:111220:4',55.1613,82.9529),(201,'СиДВ','ИК7','Емельянов','Солидарности Механическая мастерская','Новосибирская область, г. Новосибирск,ул. Солидарности, дом 103',NULL,NULL,55.1621,82.9538),(202,'СиДВ','ИК7','Емельянов','Солидарности Помещение под мастерские','Новосибирская область, г. Новосибирск,ул. Солидарности, дом 103',NULL,NULL,55.1614,82.9534),(203,'СиДВ','ИК7','Емельянов','Солидарности Склад материальный 1','Новосибирская область, г. Новосибирск,ул. Солидарности, дом 103',NULL,NULL,55.1605,82.9531),(204,'СиДВ','ИК7','Емельянов','Солидарности Склад материальный 2','Новосибирская область, г. Новосибирск,ул. Солидарности, дом 103',NULL,NULL,55.1608,82.9528),(205,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Земельный участок','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,'54:19:093502:5891',55.2352,82.9452),(206,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Асфальтоустановка 1','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(207,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Асфальтоустановка 2','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(208,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Асфальтоустановка 3','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(209,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Битумная яма','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(210,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Битумоплавильная','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(211,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Здание бани','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(212,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Здание казармы','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(213,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Здание котельной','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(214,'СиДВ','ИК7','Емельянов','Сосновка АБЗ КПП1','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(215,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Здание слесарной мастерской','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(216,'СиДВ','ИК7','Емельянов','Сосновка АБЗ КТПН','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(217,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Насосная станция с битумной ямой','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(218,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Открытый склад из жб плит','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(219,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Пилорама','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(220,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Проезд','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(221,'СиДВ','ИК7','Емельянов','Сосновка АБЗ Скважина','Новосибирская область, Новосибирский район, МО Кубовинского сельсовета',NULL,NULL,55.2352,82.9452),(222,'СиДВ','ИК7','Емельянов','Транспортная 1 Гараж аб ОК 6801','Омская обл, Омск, 3-я Транспортная, 1а',NULL,NULL,54.956,73.4049),(223,'СиДВ','ИК7','Емельянов','Транспортная 1 Гараж ОМ 7505','Омская обл, Омск, 3-я Транспортная, 1а',NULL,NULL,54.9558,73.4039),(224,'СиДВ','ИК7','Емельянов','Транспортная 1 Забор аб ОМ 7504 ','Омская обл, Омск, 3-я Транспортная, 1а',NULL,NULL,54.955,73.4045),(225,'СиДВ','ИК7','Емельянов','Транспортная 1 Пристройка к управлению','Омская обл, Омск, 3-я Транспортная, 1а',NULL,NULL,54.9562,73.4048),(226,'УЭИ','ПЭИ2','Солтан','Вешних вод Арсенал 59','Москва, ул. Вешних вод, вл.4 ',NULL,NULL,55.8581,37.7023),(227,'УЭИ','ПЭИ2','Солтан','Химки УНР 277','МО, Химки, ул. Пожарского, д.5',NULL,NULL,55.8908,37.489),(228,'УЭИ','ПЭИ3','Алексеев','Очаковское','Москва, Очаковское ш., 5А','г. Москва, Аминьево-Очаково (Гагаринский район)','77:07:0012008:3716',55.6913,37.4579),(229,'УЭИ','ПЭИ3','Алексеев','Химки Кирова Новатор МинОбороны','Московская область, г. Химки, ул. Кирова, вл. 24',NULL,'50:10:0010210:3078',55.8844,37.4538);
/*!40000 ALTER TABLE `explobject` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explobjectmanager`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explobjectmanager` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `tu` int(11) DEFAULT NULL,
  `ik` int(11) DEFAULT NULL,
  `fio` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explobjectmanager` WRITE;
/*!40000 ALTER TABLE `explobjectmanager` DISABLE KEYS */;
INSERT INTO `explobjectmanager` VALUES (1,'Алексеев','+7 (916) 731 56 17','alekseevab@oboronstroy.ru',1,3,'Алексеев А.Б.'),(2,'Белорусова','+7 (908) 656 48 47','cpi52iko@mail.ru',3,5,'Белорусова Е.С.'),(3,'Богатырев','+7 (914) 656 03 12','ter.upr-dv@mail.ru\r',3,1,'Богатырев Сергей Вячеславович\r'),(4,'Броневич','+7 (911) 921 35 15','filial1_poligon@mail.ru\r',2,4,'Броневич Андрей Иванович'),(5,'Бучинский','+7 (911) 954 27 59, +7 (812) 251 53 15','bua_66@mail.ru',2,2,'Бучинский Ю.А.'),(6,'Волков','+7 (916) 731 39 86','vgn74@mail.ru',1,1,'Волков Геннадий Николаевич'),(7,'Воробьев','+7 (918) 105 33 18','56-guov@mail.ru',1,4,'Воробьёв Владимир Владимирович\r'),(8,'Емельянов','+7 (383) 260 26 01\r','57hru@mail.ru',3,7,'Емельянов В.Ф.'),(9,'Ларионов','+7 (901) 377 85 60','7578629@inbox.ru',2,3,'Ларионов Александр Иванович'),(10,'Лёгоньких','+7 (921) 570 98 34','mz7@list.ru',2,7,'Лёгоньких Сергей Борисович'),(11,'Лобзин','+7 (921) 958 74 13','Igor.lobzin@yandex.ru',2,1,'Лобзин Игорь Станиславович\r'),(12,'Мартынов','+7 (981) 475 55 56','sambiamo@mail.ru',2,5,'Мартынов Олег Владимирович'),(13,'Пастернак','+7 (921) 034 14 02','zvmsu20101@mail.ru\r',2,6,'Пастернак Александр Васильевич'),(14,'Разгон','+7 (962) 584 91 50','a_razgon@mail.ru',3,3,'Разгон Андрей Михайлович'),(15,'Солтан','+7 (968) 897 61 51','soltannp@oboronstroy.ru; tarasenko@guov.ru',1,2,'Солтан Николае Павлович\r'),(16,'Токарев','+7 (902) 763 86 09','lzu3005@mail.ru',3,6,'Токарев Федор Валентинович\r'),(17,'Туркин','+7 (962) 281 06 22','alexcontakt@mail.ru',3,2,'Туркин Алексей Владимирович'),(18,'Ушкин','+7 (924) 500 03 01, +7 (3022) 26 02 91','52cpicitbuh@mail.ru\r',3,4,'Ушкин Николай Григорьевич\r');
/*!40000 ALTER TABLE `explobjectmanager` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explobjectpower`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explobjectpower` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `contract` varchar(255) DEFAULT NULL,
  `agreement` varchar(255) DEFAULT NULL,
  `maxAuthorizedPower` varchar(255) DEFAULT NULL,
  `maxConsumptionPower` varchar(255) DEFAULT NULL,
  `powerConsumption` varchar(255) DEFAULT NULL,
  `excess` varchar(255) DEFAULT NULL,
  `powerPoint` varchar(255) DEFAULT NULL,
  `objectId` int(11) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=110 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explobjectpower` WRITE;
/*!40000 ALTER TABLE `explobjectpower` DISABLE KEYS */;
INSERT INTO `explobjectpower` VALUES (1,'Дог. № 83102214 от 01.12.2012 г. с ОАО \" Мосэнергосбыт\"','Д.С. на Д.У.                     Сч. № 232360','270','28','10100','55%','ТП-4035 (РТП-34, ПЦ-742)',11),(2,'Дог. № 83102214 от 01.12.2012 г. с ОАО \" Мосэнергосбыт\" ','Д.С. на Д.У.                     Сч. № 223988','30','24','8700','60%','ТП-4035 (РТП-34, ПЦ-742)',7),(3,'Дог. № 83102214 от 01.12.2012 г. с ОАО \" Мосэнергосбыт\" ','Д.С. на Д.У. №     Сч.704238','120','9,2','3300','0%','ТП-4001',10),(4,'Дог. № 83102214 от 01.12.2012 г. ОАО \" Мосэнергосбыт\" ','Д.С. на Д.У. объект ГУОВ','50','5,7','2000','0%','РТП-34 (РУ-0,4 кВ)',9),(5,'Дог. № 83102214 от 01.12.2012 г. ОАО \" Мосэнергосбыт\"','Д.С. на Д.У. ','100','14,5','5200','75%','РТП-34 (РУ-0,4 кВ) ПЦ-742, ф-11',8),(6,'Дог. № 83102214 от 01.12.2012 г. с ОАО \" Мосэнергосбыт\" ','Д.С. на Д.У. ','200','32','11500','75%','ТП-№7(РУ-0,4 кВ)',8),(7,'Дог. № 83102214 от 01.12.2012 г. с ОАО \" Мосэнергосбыт\" ','Д.С. на Д.У. объект ГУОВ','28','3,3','1200','0%','ТП-12(РУ-0,4 кВ)',NULL),(8,'     Дог. № 23-07/11-РД от 11.07.11г. с ОАО \"Оборонэнергосбыт\"','Д.С. на Д.У.  31.10.2014г.  Сч. №18772391','100','27','9500','30%','ТП-4001',14),(9,'     Дог. № 23-07/11-РД от 11.07.11г. с ОАО \"Оборонэнергосбыт\"','Д.С. на Д.У. 01.09.2014г.   Сч. № 16802713','60','67,7(108) при 12 час. работе','39000','100%','ТП-№9 (РУ-0,4 кВ)',15),(10,'Дог. № 17002497 от 01.02. 2013 г. с ОАО \" Мосэнергосбыт\"','Д.С. на Д.У.','30','4,3','1550','100%','ТП-46, ПЦ-26 Ф.505 ТР-№1',13),(11,'Дог. № 143-09/10-РД ОТ 28.09.2010 г. с ОАО \" Оборонэнергосбыт\"','Д.С. на Д.У. 31.10.2014г.','35','15,5','5600','100%','ТП-26 Оборонэнерг',12),(12,'Дог. № 40800914 от 12.12.2006г. с ОАО \" Мосэнергосбыт\"','Доп. Согл на Д.У. от 20.10.2014г.','2500 (2100 +400)','442','159000','70%','ПС-681;       ПС-157',3),(13,'№ 614 от 01.09.2009 г с ОАО \"Ярославльская сбытовая компания\"','Д.С.на Д.У. от 22.10.2014г.','18','8,9','3200','40%','',16),(14,'№ 614 от 01.09.2009 г с ОАО \"Ярославльская сбытовая компания\"','Д.С.на Д.У. от 22.10.2014г.','294','34,2','12300','50%','ПС \"Ведерники\"',17),(15,'№44000514 от 01.08.2015г.с ПАО \"Мосэнергосбыт\"на АО \"ГУОВ\" на согласовании','Договор от 01.08.2015г. №44000514 ','250','40,3','14500','100%','ТП-4 мкр. Гагарина',4),(16,'Дог. № 41-07/11-РД от 18.07.2011г. с ОАО \"Оборонэнергосбыт\" ','Договор на Д.У. №  от 31.10.2014','300,5','235,7    (зима)','84859','90%','ТП №22795',21),(17,'Дог.  №121 от 01.12.2006г с ОАО Красногорская электрическая сеть\".','дог. Аренд с Энергоснаб ','64,8','Дог. энергоснабжения заключен арендатором ООО Усадба-2','Дог. энергоснабжения заключен арендатором ООО Усадба-2','Дог. энергоснабжения заключен арендатором ООО Усадба-2','Дог. энергоснабжения заключен арендатором ООО Усадба-2',22),(18,'Дог. №10704212 от 23.01.2015 с ОАО \"Оборонэнергосбыт\" ','Договор с АО \"Оборонстрой \" Д.У.','25','1,53','550','0%','ПС -705, ф 31, ТП-280',24),(19,'Дог. №77-08/11РД от 24.08.2011  с ОАО \"Оборонэнергосбыт\" ','ДС на ДУ от 01.10.2014г.','500','69,5','25000','','ТП №10',29),(20,'                                                                Дог. АО \"Оборонстрой\" Д.У. № 4254 от 01.01.2015г. с ЗАО БЭЛС  \"Балашихинская электросеть\"','пом1-18,8 пом19-18,8 пом.18-14,1 пом.17-4,7                 ','18,8','6,3','2300','0%','кТП-943',25),(21,'                                                                Дог. АО \"Оборонстрой\" Д.У. № 4254 от 01.01.2015г. с ЗАО БЭЛС  \"Балашихинская электросеть\"','пом1-18,8 пом19-18,8 пом.18-14,1 пом.17-4,7                 ','18,8','6,3','2300','0%','кТП-943',25),(22,'                                                                Дог. АО \"Оборонстрой\" Д.У. № 4254 от 01.01.2015г. с ЗАО БЭЛС  \"Балашихинская электросеть\"','пом1-18,8 пом19-18,8 пом.18-14,1 пом.17-4,7                 ','14,1','6,3','2300','0%','кТП-943',25),(23,'                                                                Дог. АО \"Оборонстрой\" Д.У. № 4254 от 01.01.2015г. с ЗАО БЭЛС  \"Балашихинская электросеть\"','пом1-18,8 пом19-18,8 пом.18-14,1 пом.17-4,7                 ','4,7','6,3','2300','0%','кТП-943',25),(24,'Дог. № 40802529        от 07.12.2009 г с ОАО \"Мосэнергосбыт\"','Договор на Д.У.на согласовании','19,6','8,3','3000','50%','ТП-121',19),(25,'Дог. №40802529  от 07.12.2009г.','Договор на Д.У. на согласовании','550','4,1','1500','47%','РП-8',20),(26,'договор на согласован.','','15','0','0','0%','',28),(27,'договор на арендатора','','20','Договор на арендатора','Договор на арендатора','Договор на арендатора','ОАО \"Славянка\"',28),(28,'Дог. 40821766 от 23.11.2006г. с ОАО \"Мосэнергосбыт\"','ДС на АО ГУОВ от 01.08.2015г. к дог. № 40821766 ','53','По расчету','По расчету','60%','ТП № 2106',18),(29,'Дог. № 1680 от 01.11. 20110г. МГУП \"Истринские электросети\"','Договор от 27.07.2015г.    № 2037','','','','70%','ТП №114',23),(30,'Дог. № 001 от 12.01.2015г. с АО Красная звезда ','Договор на Д.У.','35','14,2','4080 (лето)       5110 (зима)','100%','ТП №285',43),(31,'Дог. № 97118262 от 01.11.2014г. С ОАО \"Мосэнергосбыт\"','Договор на Д.У.','286','225','81000','100%','ТП 14563',41),(32,' Дог.№40804769 от01.07.2014г ОАО \"Мосэнергосбыт\"','Договор на ГУОВ  с 01.03.2015г. На Д.У. Д.С.','1000 (600+400)','182','65500','95%','Ввод №1 ТП 10045; ввод №2 ТП=-10415',33),(33,'№М/СЖФ/13 от 03.07.2014г. ОАО \"Славянка\"','Договор на ГУОВ на согласовании  в ОАО Славянка','15','15,24','5487','100%','от эл. уст. ОАО \"Славянка\"',38),(34,' Дог. №45-07/11РД от 21.07.2011г. ОАО \"Оборонэнргосбыт\"','Договор на Д.У.','55','38,9','13993','100%','ТП \"Выстрел\"',34),(35,'Дог. №40806162 от01.09.2013г.ОАО \"Мосэнергосбыт\"','Договор на ГУОВ  от 01.09.2013г. № 40806162 ','38,98 увеличение до 80','49,3','17750','0%','ТП № 13850 Луч А, Луч Б ',36),(36,'Дог. №107002209 от 02.12.2013г. ОАО \"Оборонэнергосбыт\"','Договор на Д.У.','20','3,3','1200','0%','РЩ-3(в здании)',40),(37,' Дог. №113003013 от 25.02.2013г. ОАО \"Оборонэнергосбыт\"','Д.С. На Д.У. от 01.02.2015г.','55,93','46,9','27000','73%','о',44),(38,'Дог. №83135610 от 04.08.2008г. ОАО \"Мосэнергосбыт\"','Договор на Д.У.','7','6,9','2500','0%','ПЦ 280 Фидер №4',44),(39,'Дог. АО ГУОВ №60004669 от 28.07.2015  с ОАО \"Мосэнергосбыт\"  ','Договор ГУОВ','600','158,7','57100','100%','ПС-45; ТП-4566                   ВРУ 19770;ВРУ 19771; 18район МКС',42),(40,'Дог. №45/13К от 01.01.2013г.с ОАО \"СУ МР\" ?????','Дог. на ГУОВ на согласовании','100','3','1100','0%','ТП 12901',47),(41,'Дог. №215345 от07.04.2014г. ОАО «Кубаньэнергосбыт»','Договор на Д.У.','20( увел на 15)','28','8411,66666666667','82','ТП-176',53),(42,'Дог. №215345 от07.04.2014г. ОАО «Кубаньэнергосбыт»','Договор на Д.У.','10 (увел на 15)','0','0','0','ТП-176',53),(43,'Дог. №215345 от07.04.2014г. ОАО «Кубаньэнергосбыт»','Договор на Д.У.','67','88,8','26646,1666666667','79','ТП-74',52),(44,'Дог. №215345 от07.04.2014г. ОАО «Кубаньэнергосбыт»','Договор на Д.У.','30','5,3','1618,33333333333','65','ТП-428',55),(45,'отсутствует энергопотребление(незавершённый строительством обьект)','отсутствует энергопотребление(незавершённый строительством обьект)','отсутствует энергопотребление(незавершённый строительством обьект)','отсутствует энергопотребление(незавершённый строительством обьект)','отсутствует энергопотребление(незавершённый строительством обьект)','отсутствует энергопотребление(незавершённый строительством обьект)','отсутствует энергопотребление(незавершённый строительством обьект)',56),(46,'Дог. №06.23.217 от02.08.2010г.ОАО«Оборонэнергосбыт','Договор на Д.У.','20','11,2','3367,33333333333','94','ТП Х 254',57),(47,'Дог. №215345 от07.04.2014г. ОАО «Кубаньэнергосбыт»','Договор на Д.У.','30','24,2','7245,66666666667','100','ТП-454',54),(48,'Дог. № 904 от01.01.2010г.ОАО «НЭСК»','на согласовании и подписании в АО«Оборонстрой»','100','41,4','12341,6666666667','43','ТП-197',51),(49,'Дог. №11-02-30 от 01.08.2010г. с ОАО \"Оборонэнергосбыт\" ','Д.С. на Д.У.№8 от 10.02. 2015г.','15','9,11','3280','100,00','ТП-186(РУ-0,4кВ)',106),(50,'Дог. №11-02-42 от 01.09.2010г. с ОАО \"Оборонэнергосбыт\" ','Д.С. на Д.У.№28 от 10.02. 2015г.','70','64,76','23314,41','45,00','ТП-244(РУ-0,4кВ) ',114),(51,'Дог. №11-02-42 от 01.09.2010г. с ОАО \"Оборонэнергосбыт\" ','Д.С. на Д.У.№28 от 10.02. 2015г.','175','144,544444444444','52036','64,91','ТП-4670(РУ-0,4 кВ)',111),(52,'Дог. №11-02-42 от 01.09.2010г. с ОАО \"Оборонэнергосбыт\" ','Д.С. на ДУ.№28 от 10.02. 2015г.','150','37,3060185185185','13430,1666666667','100,00','ТП-338(РУ-6кВ)',110),(53,'Дог. №11-02-42 от 01.09.2010г. с ОАО \"Оборонэнергосбыт\" ','Д.С. на ДУ.№28 от 10.02. 2015г.','60','2,74537037037037','988,333333333333','100,00','РТ-21(РУ-0,4 кВ)',116),(54,'Дог. №11-02-42 от 01.09.2010г. с ОАО \"Оборонэнергосбыт\" ','Д.С. На ДУ.№28 от 10.02. 2015г.','25','1,47175925925926','529,833333333333','100,00','ТП-84 (РУ-0,4 кВ)',115),(55,'Дог. №11-02-42 от 01.09.2010г. с ОАО \"Оборонэнергосбыт\" ','Д.С. На ДУ.№28 от 10.02. 2015г.','108','5,50601851851852','1982,16666666667','42,83','ТП-2026(РУ-0,4 кВ)',126),(56,'Дог. № А1300   от 09.06. 2014г. С Артёмовское отделение  филиала ОАО \"ДЭК\" ','Д.С. На ДУ. От 01. 2015г.','10','13,8800925925926','4996,83333333333','100,00','ТП-160(РУ-0,4 кВ)',101),(57,'Дог. №2532            от 19.01.2015г. С Владивостокское отделение          Филиала ОАО \"ДЭК\"','Договор на Д.У.','40','4,64259259259259','1671,33333333333','0,00','ТП-0143, Опора №2, ВЛ-0,4кВ ',112),(58,'Дог. №11-02-371/1 от 28.022012г.           С ОАО \"Оборонэнер госбыт\"','Д.С.№13 от 10.02.2015г на АО \"ГУОВ\"','420','283,713888888889','102137','53,25','РП-6(РУ-6кВ),ТП-125(РУ-0,4кВ),ТП-230(РУ-0,4кВ),ТП-230А(РУ-6кВ),КТП-1(РУ-6кВ) ',121),(59,'Дог. № 11-02-30 от 01.08.2010 г.с ОАО       \" Оборонэнергосбыт\" ','Д.С. на Д.У.№8 от 10.02.2015г. ','30','22,5','6750','100,00','ВРУ 0,4кВ',108),(60,'Дог. №А1300 от 09.06.2014г.  с Артёмовским отделением филиала ОАО \"ДЭК\"                                                  ','Д.С. на Д.У. 06.07.2015г.','17','_','0','0,00','ТП-№148 (РУ-0,4 кВ)',102),(61,'Дог. № б\\н от 01.10.2010г. с КГУП \"Примтеплоэнерго\" ','','','','','','',130),(62,'Дог. №27 от 25.07.2011г с ОАО \"Оборонэнергосбыт\" от 25.07.2011г','Д.С. на Д.У. от 18.01.2015г.','70','3,9337962962963','1416,16666666667','0%','ТП-399',132),(63,'Дог. №27 от 25.07.2011г с ОАО \"Оборонэнергосбыт\" от 25.07.2011г','Д.С. на Д.У.от 18.01.2015г.','15','25,9462962962963','9340,66666666667','7%','ТП-144',137),(64,'Дог. №27 от 25.07.2011г с ОАО \"Оборонэнергосбыт\" от 25.07.2011г','Д.С. на Д.У. от 18.01.2015г.','70','5,93518518518518','2136,66666666667','0%','ТП-144',136),(65,'Дог. №27 от 25.07.2011г с ОАО \"Оборонэнергосбыт\" от 25.07.2011г','Д.С. на Д.У.от 18.01.2015г.','150','16,9444444444444','6100','73%','ТП-146',139),(66,'Дог. №27 от 25.07.2011г с ОАО \"Оборонэнергосбыт\" от 25.07.2011г','Д.С. на Д.У.    от 18.01.2015г.','30','49,6416666666667','17871','15%','ТП-832',142),(67,'Дог. №27 от 25.07.2011г с ОАО \"Оборонэнергосбыт\" от 25.07.2011г','Д.С. на Д.У.    от 18.01.2015г.','10','2,44907407407407','881,666666666667','0%','сведений нет',141),(68,'Дог.№ 1409  от 12.12.2012 г. с ОАО \"ДЭК\"','Д.С. На АО \"ГУОВ\" от 01.05.2014г.','311','104,463888888889','37607','100%','ТП-150 (ф17, Ф18, Ф19, Ф20)',146),(69,'Дог.№ 1409  от 12.12.2012 г. с ОАО \"ДЭК\"','Д.С. На АО \"ГУОВ\"от 01.05.2014г.','289,81','41,8125','15052,5','97%','КТПН-\"УНР СР\" (РУ-0,4 кВ Ф9, Ф2, Ф5, ВЛ-0,4кВ оп.6.)',147),(70,'Дог. №09.75.101/36  с ОАО \"Оборонэнергосбыт\" от 05.09.2013г.','Д.С. на Д.У. 24.02.2015г.','15','8,6','3116,33333333333','100%','ТП-9',150),(71,'Дог. №102204   с Читинский энергосбыт ОАО \"ТГК-14\" от 10.01.2008г.','Дог. С ОАО \"234 С.У.\"','15','0','0','0,00','ВРУ 0,4кВ',149),(72,'Дог. №12996 от 01.01.2015г с ООО \"Иркутская Энергосбытовая компания\"','Дог. На Д.У.','94','14,800462962963','5328,16666666667','87,00','РУ 0,4 кВ РП №13',151),(73,'Договор на отпуск электроэнер гии № 1376 от 02.10.2006г с ОАО \"Красноярскэнергос быт»','Д.С. на             Д.У.  От 01.02.2015г.','450','18,5902777777778','6692,5','66,00%','ТП-548                (РУ-10кВ)      ',170),(74,'Договор на отпуск электроэнер гии № 1376 от 02.10.2006г с ОАО \"Красноярскэнергос быт»','Д.С. на             Д.У.  От 01.02.2015г.','370','45,0555555555556','16220','85,00%','ТП-9000               (РУ-10кВ)',166),(75,'Договор на отпуск электроэнер гии № 1376 от 02.10.2006г с ОАО \"Красноярскэнергос быт»','Д.С. на             Д.У.  От 01.02.2015г.','120','0,878703703703704','316,333333333333','82,00%','ТП-50     (РУ-0,4кВ)',155),(76,'Договор на отпуск электроэнер гии № 1376 от 02.10.2006г с ОАО \"Красноярскэнергос быт»','Д.С. на             Д.У.  От 01.02.2015г.','120','26,962962962963','9706,66666666667','83,00%','ТП-50     (РУ-0,4кВ)',155),(77,'Договор на отпуск электроэнер гии № 1376 от 02.10.2006г с ОАО \"Красноярскэнергос быт»','Д.С. на             Д.У.  От 01.02.2015г.','30','19,0601851851852','6861,66666666667','61,00%','ТП-595                (РУ-0.4кВ)',174),(78,'Дог. №О-5940 от 19.01.2015г с ОАО \"Новосибирскэнергосбыт\"','Дог. на Д.У.','247','132,046296296296','47536,6666666667','96%','ТП-28              (РУ-10 кВ)',176),(79,'Дог. №О-5940 от 19.01.2015г с ОАО \"Новосибирскэнергосбыт\"','Дог. на Д.У.','240','0','0','0,00','ТП УНР51   (РУ-10 кВ)',175),(80,'№ 95-3922 от 20.05.2015 с ОАО \"Петербургская сбытовая компания\" на АО \"Оборонстрой\" Д.У','Дог. на Д.У.','30','9,46','3407,5','100','ТП-7564 (ВРУ-04кВ)',222),(81,'Дог. №78179 от04.12.12г.ОАО \"Оборонэнергосбыт ','договор №  03145 от 06.07.15 направлен на согласование в Москву (\"Оборонстрой\" \"Д.У.\")','150','102,372222222222','36854','100,0','ТП-446',60),(82,'Дог.№54839 ОАО\"Петербурская сбытовая компания\"','договор №  03145 от 06.07.15 направлен на согласование в Москву   (\"Оборонстрой\" \"Д.У.\")','220','110,555555555556','39800','42,0','ТП-167',63),(83,'дог.№01453от01.01.07г.ОАО\"Петербурская сбытовая компания\"','ДС №10 на \"Оборонстрой\" \"Д.У.\" направлено на подписание в Москву 03.08.15','90','30,4814814814815','10973,3333333333','72,0','ТП -3009',59),(84,'дог.№01453от01.01.07г.ОАО\"Петербурская сбытовая компания\"','договор № 54839 от 28.08.2014 ОАО \"ГУОВ\" подписан , ДС на АО \"Оборонстрой\" \"Д.У.\" направлено на согласование в Москву 15.07.15','250','18','6480','100,0','ТП - 3253',58),(85,'дог.№78051от01.07.10г.ОАО\"Оборонэнергосбыт\"','Подписаны ДС № 10, № 11 от 30.12.2014 на АО \"ГУОВ\" ','400','30,0037037037037','10801,3333333333','51,0','ТП-298',61),(86,'дог.№52101от.09.10.14ггОАО\"Петербурская сбытовая компания\"','ДС №10 на \"Оборонстрой\" \"Д.У.\" направлено наподписание в Москву 03.08.15','70,2990740740741','24,6046759259259','25307,6666666667','76,0','ТП - 146',66),(87,'дог.№52101от.09.10.14ггОАО\"Петербурская сбытовая компания\"','договор № 54839 от 28.08.2014 ОАО \"ГУОВ\" подписан, ДС на АО \"Оборонстрой\" \"Д.У.\" направлено на согласование в Москву 15.07.15','46,4157407407407','16,2455092592593','16709,6666666667','79,0','ТП - 5419',67),(88,'№06648 от 01.01.2007 г.  ОАО \"ПСК\" ','01.07.15 договор №  03145 от 06.07.15 направлен на согласование в Москву   (\"Оборонстрой\" \"Д.У.\") (подписан заранее, наш экз. у нас 06.07.15)','100','Потребления электроэнергии нет','Потребления электроэнергии нет','Потребления электроэнергии нет','ТП-2409',68),(89,'дог.№44160от01.01.08г.ОАО\"ПСК\"','направлено Уведомление о передаче прав и обязанностей  АО \"Оборонстрой\" \"Д.У.\" вх. 1513-110/10 от 30.04.2015; 19.06.15 запросили доп. Док.  - направила по эл. Почте.','54,8333333333333','19,1916666666667','19740','100,0','ТП - 603',76),(90,'дог.№23-044160        от 01.01.08г \"ПСК\"             ','направлено Уведомление + ДС о передаче прав и обязанностей  АО \"Оборонстрой\" \"Д.У.\" вх. 1513-110/10 от 30.04.2015; 19.06.15 запросили доп. Док.  - направила по эл. Почте.','0,212962962962963','0,074537037037037','76,6666666666667','100,0','ТП - 508',78),(91,'дог.№.1202 от 01.12.2012г ОАО \"Оборонэнергосбыт\"','ДС на \"Оборонстрой\" \"Д.У.\" направлено 29.06.15 на подписание  в Москву 03.08.15','29,5','10,325','10620','100,0','ТП - 421',75),(92,'д.№78051-к от19.05.14г.ОАО\"Оборонэнергосбыт\"','ДС №4 на \"Оборонстрой\" \"Д.У.\" направлено на согласование в Москву 18.06.15','45','','','11,0','ТП - 410',74),(93,'д.№1202 от01.12.12г.ОАО\"Оборонэнергосбыт\"','ДС с АО \"Оборонстрой\" \"Д.У.\" направлено в Москву на подписание 03.08.15','45','15,8333333333333','5700','100,0','ТП - 29',72),(94,'д.№309 от01.12.12г ОАО\"Оборонэнергосбыт\".','ДС на \"Оборонстрой\" \"Д.У.\" направлено 29.06.15 на подписание  в Москву 03.08.15','150','22,575','8127','88,0','ТП- 440',71),(95,'дог.№53140 от 01.04.06г. ОАО \"Петербурская сбытовая компания\"','Договор № 53787 от 01.03.2015 г. с Оборонстрой\" \"Д.У.\" ','107','130,702777777778','47053','83,0','ТП -5 ТП -6; ТП-9;ТП -10',79),(96,'дог.№50364от01.12.07г. ОАО\"Петербурская сбытовая компания\"','Соглашение о расторжении дог. № 50630 от 01.12.2014 . + Договор № 50661 от 01.03.2015 г. с Оборонстрой\" \"Д.У.\" ','200','19,0175925925926','6846,33333333333','100,0','ТП - 262      ТП - 263  ',NULL),(97,'дог.№6244 17.10.2014г.ОАО \"Оборонэнергосбыт\"','3ДС направлены в Москву на согласование 11.08.15 № Сз-4407','80','63,3740740740741','22814,6666666667','48,0','ТП-881',84),(98,'дог.№6244 17.10.2014г.ОАО \"Оборонэнергосбыт\"','нет','Договор на АО 31ГиПСС','Договор на АО 31ГиПСС','Договор на АО 31ГиПСС','Договор на АО 31ГиПСС','',81),(99,'Дог. № 03/19/085 от       31.12.13г.ОАО         \"Оборонэнергосбыт\" ','АО \"ГУОВ\"','60','72,8046296296296','26209,6666666667','96,0','ТП -133',94),(100,'дог.№11612 от        02.03.13г.  АО           \"МРСК Северо-Запад\"','договор № 511101612 от 02.02.2015, направлено ДС на Оборонстрой  07.04.15','300','307,474074074074','110690,666666667','61,0','ТП -64',87),(101,'дог.№2436 от 21.03.11г ОАО \"КРЭС\"','ДУ','100','0','0','100,0','РП -23',88),(102,'Дог. № 03/19/085 от       31.12.13г.ОАО         \"Оборонэнергосбыт\" ','АО \"ГУОВ\"','224','190,801851851852','68688,6666666667','65,0','ТП-33            ТП-35',93),(103,' ','энергопотребления нет','энергопотребления нет','0','0','','КТП -673',86),(104,'Дог. № 03/19/085 от       31.12.13г.ОАО         \"Оборонэнергосбыт\" ','АО \"ГУОВ\"','31.2','41,487962962963','14935,6666666667','65,0','ТП -29                   РУ -6',95),(105,'Дог. № 03/19/085 от       31.12.13г.ОАО         \"Оборонэнергосбыт\" ','АО \"ГУОВ\"','7','22,2342592592593','8004,33333333333','0,0','ТП - 2                       ТП - 3',92),(106,'Дог. № 511306033 от 02.02.15г АО \"АтомЭнергоСбыт\" ','дог.№511306033 от 02.02.2015 + направлен пакет док. и трехстороннее доп. Согл.  (через Новохрост И. с сопроводит на Пастернака от 07.04.15)','460','225,718518518519','81258,6666666667','26,0','РТП -81',96),(107,'Дог. № 1-05487 от 04.08.14г. ОАО \"Архэнергосбыт\" ','Доп. Соглашение  от 10.03.2015 на АО \"ГУОВ\" (направлено 22.05.2015 с  И.И. Новохрост)','200','27,9351851851852','28733,3333333333','100,0','ТП-60         ТП-59',85),(108,'Дог.№24-000017 от 01.05.10г. ОАО \"ПСК\"','АО \"ГУОВ\" ДС с 12.06.2015','2800','1092','393000','86,0','РП- 2210                       РП -2186        ТП-1;ТП-2   ТП-3 -ТП-5',97),(109,'Дог.№27467 от 01.01.01г. ОАО \"ПСК\"','Договор  на ФГУП \"122 УМР МО РФ\" на переоф.','120','25,8','9280','74,0','РП - 7522',98);
/*!40000 ALTER TABLE `explobjectpower` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `explsclass`;
/*!50001 DROP VIEW IF EXISTS `explsclass`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsclass` AS SELECT 
 1 AS `rowid`,
 1 AS `name`,
 1 AS `translate`,
 1 AS `interface`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explsclassprop`;
/*!50001 DROP VIEW IF EXISTS `explsclassprop`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsclassprop` AS SELECT 
 1 AS `rowid`,
 1 AS `cid`,
 1 AS `pid`,
 1 AS `name`,
 1 AS `translate`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explscontrolnf`;
/*!50001 DROP VIEW IF EXISTS `explscontrolnf`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explscontrolnf` AS SELECT 
 1 AS `rowid`,
 1 AS `number`,
 1 AS `date`,
 1 AS `summary`,
 1 AS `applicant`,
 1 AS `responsible`,
 1 AS `stage`,
 1 AS `status`,
 1 AS `cause`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explsmainmenu`;
/*!50001 DROP VIEW IF EXISTS `explsmainmenu`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsmainmenu` AS SELECT 
 1 AS `rowid`,
 1 AS `name`,
 1 AS `caption`,
 1 AS `src`,
 1 AS `classes`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explsobject`;
/*!50001 DROP VIEW IF EXISTS `explsobject`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsobject` AS SELECT 
 1 AS `rowid`,
 1 AS `tu`,
 1 AS `ik`,
 1 AS `manager`,
 1 AS `name`,
 1 AS `address`,
 1 AS `comment`,
 1 AS `cadastr`,
 1 AS `lat`,
 1 AS `lon`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explsobjectmanager`;
/*!50001 DROP VIEW IF EXISTS `explsobjectmanager`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsobjectmanager` AS SELECT 
 1 AS `rowid`,
 1 AS `name`,
 1 AS `phone`,
 1 AS `email`,
 1 AS `tu`,
 1 AS `ik`,
 1 AS `fio`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explsobjectpower`;
/*!50001 DROP VIEW IF EXISTS `explsobjectpower`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsobjectpower` AS SELECT 
 1 AS `rowid`,
 1 AS `tu`,
 1 AS `ik`,
 1 AS `name`,
 1 AS `address`,
 1 AS `contract`,
 1 AS `agreement`,
 1 AS `maxAuthorizedPower`,
 1 AS `maxConsumptionPower`,
 1 AS `powerConsumption`,
 1 AS `excess`,
 1 AS `powerPoint`,
 1 AS `powerId`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explsterritorialdepartment`;
/*!50001 DROP VIEW IF EXISTS `explsterritorialdepartment`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsterritorialdepartment` AS SELECT 
 1 AS `rowid`,
 1 AS `name`,
 1 AS `manager`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explsuser`;
/*!50001 DROP VIEW IF EXISTS `explsuser`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `explsuser` AS SELECT 
 1 AS `rowid`,
 1 AS `fio`,
 1 AS `ip`,
 1 AS `email`,
 1 AS `policy`,
 1 AS `login`,
 1 AS `password`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `explterritorialdepartment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `explterritorialdepartment` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `manager` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `explterritorialdepartment` WRITE;
/*!40000 ALTER TABLE `explterritorialdepartment` DISABLE KEYS */;
INSERT INTO `explterritorialdepartment` VALUES (1,'УЭИ',NULL),(2,'СЗТП',NULL),(3,'СиДВ',NULL);
/*!40000 ALTER TABLE `explterritorialdepartment` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `expluser`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `expluser` (
  `rowid` int(11) NOT NULL AUTO_INCREMENT,
  `fio` varchar(255) DEFAULT NULL,
  `ip` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `policy` varchar(255) DEFAULT NULL,
  `login` varchar(100) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`rowid`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `expluser` WRITE;
/*!40000 ALTER TABLE `expluser` DISABLE KEYS */;
INSERT INTO `expluser` VALUES (1,'Кульша В.И.','127.0.0.1','kulshavi@guov.ru','[[\"view\",\"add\",\"upd\",\"del\"],[\"view\",\"add\",\"upd\",\"del\"],[\"view\",\"add\",\"upd\",\"del\"],[\"view\",\"add\",\"upd\",\"del\"]]','admin','Rekmif1983'),(2,'Стандартный пользователь',NULL,NULL,'[[],[\"view\"],[],[\"view\"]]','user','123'),(3,'Пользователь Отдела эксплуатации имущества',NULL,NULL,'[[],[\"view\"],[\"view\"],[\"view\"]]','pto','123'),(4,'Пользователь Сводно-аналитического отдела',NULL,NULL,'[[],[\"view\"],[],[\"view\"]]','svod','123');
/*!40000 ALTER TABLE `expluser` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `link`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `link` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `o1` bigint(20) DEFAULT NULL,
  `o2` bigint(20) DEFAULT NULL,
  `c` bigint(20) DEFAULT '1',
  `d` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `o1` (`o1`),
  KEY `o2` (`o2`),
  KEY `c` (`c`)
) ENGINE=InnoDB AUTO_INCREMENT=82 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `link` WRITE;
/*!40000 ALTER TABLE `link` DISABLE KEYS */;
INSERT INTO `link` VALUES (1,1,NULL,1,'2016-04-27 12:04:00'),(10,3,2,1,'2016-04-28 12:28:36'),(11,4,2,1,'2016-04-27 06:12:13'),(12,5,2,1,'2016-04-27 06:12:13'),(13,6,2,1,'2016-04-27 06:12:13'),(14,7,2,1,'2016-04-27 06:12:49'),(15,8,2,1,'2016-04-27 06:12:52'),(18,11,8,1,'2016-04-27 06:13:09'),(19,12,8,1,'2016-04-27 06:13:09'),(20,13,8,1,'2016-04-27 06:13:09'),(23,17,14,1,'2016-04-28 08:43:12'),(24,18,14,1,'2016-04-27 06:13:39'),(25,19,14,1,'2016-04-27 06:13:39'),(26,3,20,1,'2016-04-27 06:14:04'),(27,4,20,1,'2016-04-27 06:14:06'),(28,5,20,1,'2016-04-27 06:14:07'),(29,6,20,1,'2016-04-27 06:14:08'),(30,7,20,1,'2016-04-27 06:14:08'),(31,8,21,1,'2016-04-27 06:14:36'),(34,11,21,1,'2016-04-27 06:14:37'),(35,12,21,1,'2016-04-27 06:14:38'),(36,13,21,1,'2016-04-27 06:14:38'),(37,14,21,1,'2016-04-27 06:14:38'),(40,17,21,1,'2016-04-27 06:14:41'),(41,18,21,1,'2016-04-27 06:14:41'),(42,19,21,1,'2016-04-27 06:14:42'),(45,11,5,1,'2016-04-27 06:16:00'),(46,12,6,1,'2016-04-27 06:16:00'),(47,13,7,1,'2016-04-27 06:16:00'),(50,17,5,1,'2016-04-27 06:16:21'),(51,18,6,1,'2016-04-27 06:16:21'),(52,19,7,1,'2016-04-27 06:16:22'),(53,14,2,1,'2016-04-27 10:27:28'),(56,22,2,1,'2016-04-27 10:33:12'),(57,23,2,1,'2016-04-27 10:33:12'),(62,25,24,1,'2016-04-27 12:41:08'),(67,25,4,1,'2016-04-28 08:42:37'),(68,25,21,1,'2016-04-28 08:25:29'),(69,25,14,1,'2016-04-28 08:25:30'),(72,25,8,1,'2016-04-28 13:02:26'),(76,1,3,1,'2016-04-28 12:27:51'),(77,8,1,1,'2016-04-28 13:01:38'),(78,14,1,1,'2016-04-28 12:28:58'),(79,1,21,1,'2016-04-28 12:33:44');
/*!40000 ALTER TABLE `link` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `link_copy`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `link_copy` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `o1` bigint(20) DEFAULT NULL,
  `o2` bigint(20) DEFAULT NULL,
  `c` bigint(20) DEFAULT '1',
  `d` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `o1` (`o1`),
  KEY `o2` (`o2`),
  KEY `c` (`c`)
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `link_copy` WRITE;
/*!40000 ALTER TABLE `link_copy` DISABLE KEYS */;
INSERT INTO `link_copy` VALUES (1,1,NULL,1,'2016-04-02 18:43:57'),(2,2,NULL,1,'2016-04-06 09:12:35'),(3,3,NULL,1,'2016-04-06 09:12:36'),(4,4,NULL,1,'2016-04-06 09:12:36'),(5,5,NULL,1,'2016-04-06 09:12:36'),(6,6,NULL,1,'2016-04-06 09:12:37'),(7,7,NULL,1,'2016-04-06 09:12:37'),(8,8,NULL,1,'2016-04-06 09:12:37'),(9,9,NULL,1,'2016-04-06 09:12:37'),(10,10,NULL,1,'2016-04-06 09:12:38'),(11,11,NULL,1,'2016-04-06 09:12:38'),(12,12,NULL,1,'2016-04-06 09:12:38'),(13,13,NULL,1,'2016-04-06 09:12:39'),(14,14,NULL,1,'2016-04-06 09:12:40'),(15,15,NULL,1,'2016-04-06 09:12:41'),(16,16,NULL,1,'2016-04-06 09:12:43'),(17,17,NULL,1,'2016-04-06 09:12:44'),(18,18,NULL,1,'2016-04-06 09:12:44'),(19,19,NULL,1,'2016-04-06 09:12:44'),(20,20,NULL,1,'2016-04-06 09:12:44'),(21,21,NULL,1,'2016-04-06 09:12:44'),(22,22,NULL,1,'2016-04-06 09:12:45'),(23,23,NULL,1,'2016-04-06 09:12:45'),(24,24,NULL,1,'2016-04-06 09:12:45'),(25,25,NULL,1,'2016-04-06 09:12:46'),(26,26,NULL,1,'2016-04-06 09:12:46'),(27,27,NULL,1,'2016-04-06 09:12:46'),(28,28,NULL,1,'2016-04-06 09:12:46'),(29,29,NULL,1,'2016-04-06 09:12:47'),(30,30,NULL,1,'2016-04-06 09:12:47'),(31,31,NULL,1,'2016-04-06 09:12:47'),(32,32,NULL,1,'2016-04-06 09:12:47'),(33,33,NULL,1,'2016-04-06 09:12:49'),(34,34,NULL,1,'2016-04-06 09:12:49'),(35,35,NULL,1,'2016-04-06 09:12:49'),(36,36,NULL,1,'2016-04-06 09:12:50'),(37,37,NULL,1,'2016-04-06 09:12:51'),(38,38,NULL,1,'2016-04-06 09:12:51'),(39,39,NULL,1,'2016-04-06 09:12:51'),(40,40,NULL,1,'2016-04-06 09:12:51'),(41,41,NULL,1,'2016-04-06 09:12:52'),(42,42,NULL,1,'2016-04-06 09:12:52'),(43,43,NULL,1,'2016-04-06 09:13:50'),(44,44,NULL,1,'2016-04-06 09:13:55'),(45,45,NULL,1,'2016-04-06 09:13:55'),(46,46,NULL,1,'2016-04-06 09:13:55'),(47,47,NULL,1,'2016-04-06 09:13:55'),(48,48,NULL,1,'2016-04-06 09:13:56'),(49,49,NULL,1,'2016-04-06 09:13:56'),(50,50,NULL,1,'2016-04-06 09:13:57'),(51,51,NULL,1,'2016-04-06 09:13:58'),(52,2,1,1,'2016-04-06 09:14:10'),(53,3,2,1,'2016-04-06 09:14:10'),(54,4,2,1,'2016-04-06 09:14:10'),(55,5,2,1,'2016-04-06 09:14:10'),(56,6,2,1,'2016-04-06 09:14:11'),(57,7,3,1,'2016-04-06 09:14:11'),(58,8,7,1,'2016-04-06 09:14:11'),(59,9,7,1,'2016-04-06 09:14:11'),(60,10,7,1,'2016-04-06 09:14:11'),(61,11,7,1,'2016-04-06 09:14:11'),(62,12,7,1,'2016-04-06 09:14:11'),(63,13,4,1,'2016-04-06 09:14:11'),(64,14,4,1,'2016-04-06 09:14:11'),(65,15,5,1,'2016-04-06 09:14:11'),(66,16,15,1,'2016-04-06 09:14:11'),(67,17,16,1,'2016-04-06 09:14:11'),(68,18,16,1,'2016-04-06 09:14:11'),(69,19,16,1,'2016-04-06 09:14:11'),(70,20,16,1,'2016-04-06 09:14:11'),(71,21,20,1,'2016-04-06 09:14:11'),(72,22,20,1,'2016-04-06 09:14:11'),(73,23,20,1,'2016-04-06 09:14:11'),(74,24,20,1,'2016-04-06 09:14:11'),(75,25,20,1,'2016-04-06 09:14:11'),(76,26,20,1,'2016-04-06 09:14:11'),(77,27,20,1,'2016-04-06 09:14:11'),(78,28,20,1,'2016-04-06 09:14:11'),(79,29,15,1,'2016-04-06 09:14:11'),(80,30,29,1,'2016-04-06 09:14:11'),(81,31,29,1,'2016-04-06 09:14:11'),(82,32,5,1,'2016-04-06 09:14:11'),(83,33,32,1,'2016-04-06 09:14:11'),(84,34,32,1,'2016-04-06 09:14:12'),(85,35,26,1,'2016-04-06 09:14:12'),(86,36,24,1,'2016-04-06 09:14:12'),(87,37,24,1,'2016-04-06 09:14:12'),(88,38,35,1,'2016-04-06 09:14:12'),(89,39,5,1,'2016-04-06 09:14:12'),(90,40,39,1,'2016-04-06 09:14:12'),(91,41,39,1,'2016-04-06 09:14:12'),(92,42,6,1,'2016-04-06 09:14:12'),(93,43,42,1,'2016-04-06 09:14:12'),(94,44,43,1,'2016-04-06 09:14:12'),(95,45,42,1,'2016-04-06 09:14:12'),(96,46,45,1,'2016-04-06 09:14:12'),(97,47,6,1,'2016-04-06 09:14:12'),(98,48,6,1,'2016-04-06 09:14:12'),(99,49,6,1,'2016-04-06 09:14:12'),(100,50,6,1,'2016-04-06 09:14:12'),(101,51,6,1,'2016-04-06 09:14:12'),(102,35,36,1,'2016-04-06 14:39:37');
/*!40000 ALTER TABLE `link_copy` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `object`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `object` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `n` char(255) DEFAULT NULL,
  `d` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `n` (`n`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `object` WRITE;
/*!40000 ALTER TABLE `object` DISABLE KEYS */;
INSERT INTO `object` VALUES (1,'система','2016-04-28 11:55:46'),(2,'правило','2016-04-27 05:57:00'),(3,'правило исполнитель','2016-04-27 05:57:15'),(4,'правило условие','2016-04-27 05:57:20'),(5,'правило условие сравнение','2016-04-27 10:59:26'),(6,'правило субъект','2016-04-27 05:57:50'),(7,'правило субъект состояние','2016-04-27 05:57:58'),(8,'правило 1','2016-04-27 06:00:02'),(11,'2016-04-28 15:41:00','2016-04-28 12:40:19'),(12,'субъект 1','2016-04-28 12:41:54'),(13,'субъект состояние 1','2016-04-27 06:00:06'),(14,'правило 2','2016-04-27 06:00:18'),(17,'2016-04-28 15:41:00','2016-04-28 12:40:22'),(18,'субъект 2','2016-04-28 12:41:51'),(19,'субъект сравнения 2','2016-04-27 06:00:43'),(20,'свойство','2016-04-27 06:02:02'),(21,'справочник','2016-04-27 06:01:59'),(22,'правило исполнено','2016-04-27 10:32:17'),(23,'правило не исполнено','2016-04-27 10:32:21'),(24,'время','2016-04-27 12:24:46'),(25,'2016-04-28 16:50:00','2016-04-28 13:50:00');
/*!40000 ALTER TABLE `object` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `object_copy`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `object_copy` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `n` char(255) DEFAULT NULL,
  `d` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `n` (`n`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `object_copy` WRITE;
/*!40000 ALTER TABLE `object_copy` DISABLE KEYS */;
INSERT INTO `object_copy` VALUES (1,'Классы','2016-04-06 07:28:38'),(2,'Общество','2016-04-07 06:56:04'),(3,'Участники','2016-04-07 06:55:45'),(4,'Деятельность','2016-04-07 06:55:49'),(5,'Имущество','2016-04-07 06:55:53'),(6,'Правила','2016-04-07 06:55:56'),(7,'Контактная информация','2016-04-06 07:28:38'),(8,'Телефоны','2016-04-06 07:28:38'),(9,'Электронная почта','2016-04-06 07:28:38'),(10,'Должности','2016-04-06 07:28:38'),(11,'Пользователи базы данных','2016-04-06 07:28:38'),(12,'Адрес регистрации','2016-04-06 07:28:38'),(13,'Внутренняя деятельность','2016-04-06 07:28:38'),(14,'Внешняя деятельность','2016-04-06 07:28:38'),(15,'Активы','2016-04-06 07:28:39'),(16,'Внеоборотные активы','2016-04-06 07:28:39'),(17,'Интеллектуальная собственность','2016-04-06 07:28:39'),(18,'Лицензии','2016-04-06 07:28:39'),(19,'Займы','2016-04-06 07:28:39'),(20,'Основные средства','2016-04-06 07:28:39'),(21,'Земельные участки','2016-04-06 07:28:39'),(22,'Здания','2016-04-06 07:28:39'),(23,'Сооружения','2016-04-06 07:28:39'),(24,'Передаточные устройства','2016-04-06 07:28:39'),(25,'Транспортные средства','2016-04-06 07:28:39'),(26,'Машины и оборудование','2016-04-06 07:28:39'),(27,'Материалы','2016-04-06 07:28:39'),(28,'Инструменты и инвентарь','2016-04-06 07:28:39'),(29,'Оборотные активы','2016-04-06 07:28:39'),(30,'Дебиторская задолженность','2016-04-06 07:28:39'),(31,'Денежные средства','2016-04-06 07:28:39'),(32,'Коммунальные ресурсы','2016-04-06 07:28:39'),(33,'Источники ресурсов','2016-04-06 07:28:39'),(34,'Потребители ресурсов','2016-04-06 07:28:39'),(35,'Приборы учета потребления ресурсов','2016-04-06 07:28:39'),(36,'Линии передачи ресурсов','2016-04-06 07:28:39'),(37,'Узлы линий передачи ресурсов','2016-04-06 07:28:39'),(38,'Показания приборов учетов','2016-04-06 07:28:39'),(39,'Пассивы','2016-04-06 07:28:39'),(40,'Задолжности','2016-04-06 07:28:39'),(41,'Обязательства','2016-04-06 07:28:39'),(42,'Документы','2016-04-06 07:28:39'),(43,'Документы БТИ','2016-04-06 07:28:39'),(44,'Площадь объектов','2016-04-06 07:28:40'),(45,'Документы Росреестр','2016-04-06 07:28:40'),(46,'Кадастровый номер недвижимости','2016-04-06 07:28:40'),(47,'Показания измерений','2016-04-06 07:28:40'),(48,'Единицы измерения','2016-04-06 07:28:40'),(49,'Координаты','2016-04-06 07:28:40'),(50,'Параметры объектов','2016-04-06 07:28:40'),(51,'Права доступа к объектам базы данных','2016-04-06 07:28:40');
/*!40000 ALTER TABLE `object_copy` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `objectlink`;
/*!50001 DROP VIEW IF EXISTS `objectlink`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
/*!50001 CREATE VIEW `objectlink` AS SELECT 
 1 AS `id`,
 1 AS `n`,
 1 AS `o2`*/;
SET character_set_client = @saved_cs_client;
DROP TABLE IF EXISTS `test`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `test` (
  `f1` varchar(255) DEFAULT NULL,
  `f2` varchar(255) DEFAULT NULL,
  `f3` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `test` WRITE;
/*!40000 ALTER TABLE `test` DISABLE KEYS */;
INSERT INTO `test` VALUES ('a1','b1','c1'),('a2','b2','c2'),('a3','b3','c3');
/*!40000 ALTER TABLE `test` ENABLE KEYS */;
UNLOCK TABLES;
DROP TABLE IF EXISTS `ttt`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ttt` (
  `f1` varchar(255) DEFAULT NULL,
  `f2` varchar(255) DEFAULT NULL,
  `f3` varchar(255) DEFAULT NULL,
  `f4` varchar(255) DEFAULT NULL,
  `f5` varchar(255) DEFAULT NULL,
  `f6` varchar(255) DEFAULT NULL,
  `f7` varchar(255) DEFAULT NULL,
  `f8` varchar(255) DEFAULT NULL,
  `f9` varchar(255) DEFAULT NULL,
  `f10` varchar(255) DEFAULT NULL,
  `f11` varchar(255) DEFAULT NULL,
  `f12` varchar(255) DEFAULT NULL,
  `f13` varchar(255) DEFAULT NULL,
  `f14` varchar(255) DEFAULT NULL,
  `f15` varchar(255) DEFAULT NULL,
  `f16` varchar(255) DEFAULT NULL,
  `f17` varchar(255) DEFAULT NULL,
  `f18` varchar(255) DEFAULT NULL,
  `f19` varchar(255) DEFAULT NULL,
  `f20` varchar(255) DEFAULT NULL,
  `f21` varchar(255) DEFAULT NULL,
  `f22` varchar(255) DEFAULT NULL,
  `f23` varchar(255) DEFAULT NULL,
  `f24` varchar(255) DEFAULT NULL,
  `f25` varchar(255) DEFAULT NULL,
  `f26` varchar(255) DEFAULT NULL,
  `f27` varchar(255) DEFAULT NULL,
  `f28` varchar(255) DEFAULT NULL,
  `f29` varchar(255) DEFAULT NULL,
  `f30` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `ttt` WRITE;
/*!40000 ALTER TABLE `ttt` DISABLE KEYS */;
/*!40000 ALTER TABLE `ttt` ENABLE KEYS */;
UNLOCK TABLES;
/*!50106 SET @save_time_zone= @@TIME_ZONE */ ;
/*!50106 DROP EVENT IF EXISTS `eventObjectTime` */;
DELIMITER ;;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;;
/*!50003 SET character_set_client  = utf8 */ ;;
/*!50003 SET character_set_results = utf8 */ ;;
/*!50003 SET collation_connection  = utf8_general_ci */ ;;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;;
/*!50003 SET @saved_time_zone      = @@time_zone */ ;;
/*!50003 SET time_zone             = 'SYSTEM' */ ;;
/*!50106 CREATE*/ /*!50117 DEFINER=`root`@`localhost`*/ /*!50106 EVENT `eventObjectTime` ON SCHEDULE EVERY 1 MINUTE STARTS '2016-04-28 13:44:00' ON COMPLETION NOT PRESERVE ENABLE DO begin
	call cT();

end */ ;;
/*!50003 SET time_zone             = @saved_time_zone */ ;;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;;
/*!50003 SET character_set_client  = @saved_cs_client */ ;;
/*!50003 SET character_set_results = @saved_cs_results */ ;;
/*!50003 SET collation_connection  = @saved_col_connection */ ;;
DELIMITER ;
/*!50106 SET TIME_ZONE= @save_time_zone */ ;
/*!50003 DROP FUNCTION IF EXISTS `cO` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `cO`(val char(255)) RETURNS bigint(20)
begin
insert into object (n) value(val);
	return (select max(id) from object);
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP FUNCTION IF EXISTS `gAND` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `gAND`(oid1 bigint, oid2 bigint, oid3 bigint) RETURNS bigint(20)
return (
	select o1 from ( 
		select o1 from link where o2 in (oid1, oid2, oid3) and o1 is not null 
		union all 
		select o2 from link where o1 in (oid1, oid2, oid3) and o2 is not null 
	)o 
	group by o1 
	having count(*) = case when oid2 is null then 1 when oid3 is null then 2 else 3 end
	order by o1
	limit 1
) ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP FUNCTION IF EXISTS `gC` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `gC`(cid bigint) RETURNS text CHARSET utf8
BEGIN
  DECLARE done INT DEFAULT FALSE;
  DECLARE o bigint;
  DECLARE cc text DEFAULT '';
  DECLARE cur1 CURSOR FOR select distinct o1 from link where o2 = cid;
  DECLARE CONTINUE HANDLER FOR NOT FOUND SET done = TRUE;

  OPEN cur1;
  read_loop: LOOP
    FETCH cur1 INTO o;

    IF done THEN
      LEAVE read_loop;
    END IF;

		set cc = concat(cc, o, ',');

  END LOOP;
  CLOSE cur1;
	
	set cc = SUBSTR(cc,1,LENGTH(cc)-1);
	return cc;

end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP FUNCTION IF EXISTS `gCC` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `gCC`() RETURNS text CHARSET utf8
BEGIN
 return gC((select o1 from link where o2 is null limit 1));

end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP FUNCTION IF EXISTS `gL` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `gL`(oid1 bigint,oid2 bigint) RETURNS bigint(20)
return (select id from link where (o1=oid1 and o2=oid2) or (o1=oid2 and o2=oid1) limit 1) ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP FUNCTION IF EXISTS `gN` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `gN`(name char(255)) RETURNS bigint(20)
return (select id from object where n = name limit 1) ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP FUNCTION IF EXISTS `gO` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `gO`(oid bigint) RETURNS char(255) CHARSET utf8
return (select n from object where id = oid limit 1) ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP FUNCTION IF EXISTS `gT` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `gT`() RETURNS bigint(20)
return (select o1 from link where o2 = gN('время') limit 1) ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `cD` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `cD`()
BEGIN
	start TRANSACTION;

	create table if not exists object (
		id bigint not null auto_increment,
		n char(255),
		d timestamp,
		/*x float,
		y float,
		z float,*/
		primary key(id),
		index(n)
	);

	create table if not exists link (
		id bigint not null auto_increment,
		o1 bigint,
		o2 bigint,
		c bigint,
		d timestamp,
		primary key(id),
		index(o1),
		index(o2),
		index(c)

	);

	insert into object (n) select 'Classes';

	set @o = (select LAST_INSERT_ID());

	insert into link (o1, o2, c) values (@o, null, 1);

	COMMIT;


END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `chR` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `chR`(rule bigint)
begin
	declare executor bigint;
	declare cond bigint;
	declare condCopy bigint;
	declare subj bigint;
	declare subjCopy bigint;
	declare result bigint;
	declare newO bigint;

	set executor = gAND(rule,gN('правило исполнитель'),gN('справочник'));
	set result = gN('правило исполнено');
	if result is null then set result = cO('правило исполнено'); end if;
	
	if gL(rule, result) is null then
		set cond = gAND(rule,gN('правило условие'),gN('справочник'));
		set condCopy = gAND(rule,gN('правило условие сравнение'),gN('справочник'));
		if gO(cond) = gO(condCopy) then
			if executor = gN('система') then
				set subj = gAND(rule, gN('правило субъект'), gN('справочник'));
				set subjCopy = gAND(rule, gN('правило субъект состояние'), gN('справочник'));
				if subj is not null then
					call uO(subj, gO(subjCopy));
					call chRs(subj);
				else
					set newO = cO(gO(subjCopy));
				end if;
				call cL(rule, result);
				
			else
				set result = gN('правило не исполнено');
				if result is null then set result = cO('правило не исполнено'); end if;
				call cL(rule, result);
			end if;
		end if;
	end if;
end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `chRs` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `chRs`(condId bigint)
BEGIN
  DECLARE done INT DEFAULT FALSE;
  DECLARE rule BIGINT DEFAULT 0;
  DECLARE cur1 CURSOR FOR 
		select o1 from ( 
			select o1 from link where o2 in (gN('правило'), gN('справочник'), condId) and o1 is not null 
			union all 
			select o2 from link where o1 in (gN('правило'), gN('справочник'), condId) and o2 is not null 
		)o 
		group by o1 
		having count(*) = 3
		order by o1;

  DECLARE CONTINUE HANDLER FOR NOT FOUND SET done = TRUE;

	if gL(condId, gN('правило условие')) is not null then
		OPEN cur1;
		read_loop: LOOP
			FETCH cur1 INTO rule;

			IF done THEN
				LEAVE read_loop;
			END IF;

			call chR(rule);

		END LOOP;
		CLOSE cur1;
	end if;

end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `cL` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `cL`(oid1 int, oid2 int)
BEGIN
	if ( select count(*) from link where (o1=oid1 and o2=oid2) or (o1=oid2 and o2=oid1) ) > 0 then
		update link set c = c+1 where (o1=oid1 and o2=oid2) or (o1=oid2 and o2=oid1);

	else
		insert into link (o1, o2, c) values (oid1, oid2, 1);

	end if;	

END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `cT` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `cT`()
BEGIN
	update object set n = CURRENT_TIMESTAMP() where id = gT();
	call chRs(gT());

end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `gCO` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `gCO`(className char(255))
begin
	select * from object where id in (
		select o1 from link where o2 = (
			select id from object where n=className limit 1
		)
	);
end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `uO` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `uO`(oid bigint, val char(255))
BEGIN
	update object set n = val where id = oid;

END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50001 DROP VIEW IF EXISTS `class`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `class` AS select `o1`.`id` AS `id`,ifnull(`expl`.`link`.`o2`,'#') AS `parent`,`o1`.`n` AS `text` from (((select `expl`.`object`.`id` AS `id`,`expl`.`object`.`n` AS `n`,`expl`.`object`.`d` AS `d` from `expl`.`object` where `expl`.`object`.`id` in (select `expl`.`link`.`o1` from `expl`.`link` where isnull(`expl`.`link`.`o2`)))) `o1` left join `expl`.`link` on(((`expl`.`link`.`o2` is not null) and (`expl`.`link`.`o1` = `o1`.`id`)))) */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsclass`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsclass` AS select `explclass`.`rowid` AS `rowid`,`explclass`.`name` AS `name`,`explclass`.`translate` AS `translate`,`explclass`.`interface` AS `interface` from `explclass` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsclassprop`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsclassprop` AS select `explclassprop`.`rowid` AS `rowid`,`explclassprop`.`cid` AS `cid`,`explclassprop`.`pid` AS `pid`,`explclassprop`.`name` AS `name`,`explclassprop`.`translate` AS `translate` from `explclassprop` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explscontrolnf`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explscontrolnf` AS select `explcontrolnf`.`rowid` AS `rowid`,`explcontrolnf`.`number` AS `number`,`explcontrolnf`.`date` AS `date`,`explcontrolnf`.`summary` AS `summary`,`explcontrolnf`.`applicant` AS `applicant`,`explcontrolnf`.`responsible` AS `responsible`,`explcontrolnf`.`stage` AS `stage`,`explcontrolnf`.`status` AS `status`,`explcontrolnf`.`cause` AS `cause` from `explcontrolnf` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsmainmenu`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsmainmenu` AS select `explmainmenu`.`rowid` AS `rowid`,`explmainmenu`.`name` AS `name`,`explmainmenu`.`caption` AS `caption`,`explmainmenu`.`src` AS `src`,`explmainmenu`.`classes` AS `classes` from `explmainmenu` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsobject`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsobject` AS select `explobject`.`rowid` AS `rowid`,`explobject`.`tu` AS `tu`,`explobject`.`ik` AS `ik`,`explobject`.`manager` AS `manager`,`explobject`.`name` AS `name`,`explobject`.`address` AS `address`,`explobject`.`comment` AS `comment`,`explobject`.`cadastr` AS `cadastr`,`explobject`.`lat` AS `lat`,`explobject`.`lon` AS `lon` from `explobject` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsobjectmanager`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsobjectmanager` AS select `explobjectmanager`.`rowid` AS `rowid`,`explobjectmanager`.`name` AS `name`,`explobjectmanager`.`phone` AS `phone`,`explobjectmanager`.`email` AS `email`,`explobjectmanager`.`tu` AS `tu`,`explobjectmanager`.`ik` AS `ik`,`explobjectmanager`.`fio` AS `fio` from `explobjectmanager` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsobjectpower`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsobjectpower` AS select `op`.`objectId` AS `rowid`,`o`.`tu` AS `tu`,`o`.`ik` AS `ik`,`o`.`name` AS `name`,`o`.`address` AS `address`,`op`.`contract` AS `contract`,`op`.`agreement` AS `agreement`,`op`.`maxAuthorizedPower` AS `maxAuthorizedPower`,`op`.`maxConsumptionPower` AS `maxConsumptionPower`,`op`.`powerConsumption` AS `powerConsumption`,`op`.`excess` AS `excess`,`op`.`powerPoint` AS `powerPoint`,`op`.`rowid` AS `powerId` from (`explobjectpower` `op` left join `explsobject` `o` on((`op`.`objectId` = `o`.`rowid`))) where (`o`.`rowid` is not null) */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsterritorialdepartment`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsterritorialdepartment` AS select `explterritorialdepartment`.`rowid` AS `rowid`,`explterritorialdepartment`.`name` AS `name`,`explterritorialdepartment`.`manager` AS `manager` from `explterritorialdepartment` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `explsuser`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `explsuser` AS select `expluser`.`rowid` AS `rowid`,`expluser`.`fio` AS `fio`,`expluser`.`ip` AS `ip`,`expluser`.`email` AS `email`,`expluser`.`policy` AS `policy`,`expluser`.`login` AS `login`,`expluser`.`password` AS `password` from `expluser` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!50001 DROP VIEW IF EXISTS `objectlink`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `objectlink` AS select `o`.`id` AS `id`,`o`.`n` AS `n`,`expl`.`link`.`o2` AS `o2` from (((select `expl`.`object`.`id` AS `id`,`expl`.`object`.`n` AS `n`,`expl`.`object`.`d` AS `d` from `expl`.`object`)) `o` left join `expl`.`link` on(((`expl`.`link`.`o2` is not null) and (`expl`.`link`.`o1` = `o`.`id`)))) */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

